lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
#include "bluefruit.h"

#include <stdio.h>
#include <string.h>

#include <nrf54l15_hal.h>

using xiao_nrf54l15::BleConnectionInfo;
using xiao_nrf54l15::BleConnectionEvent;
using xiao_nrf54l15::BleConnectionRole;
using xiao_nrf54l15::BleAdvertisingChannel;
using xiao_nrf54l15::BleDisconnectDebug;
using xiao_nrf54l15::BleDisconnectReason;
using xiao_nrf54l15::BleGattCharacteristicProperty;
using xiao_nrf54l15::BleRadio;

extern "C" uint64_t nrf54l15_core_monotonic_time_us(void);
extern "C" uint32_t nrf54l15_core_monotonic_time_ms(void);

void serviceBluefruitBeforePollingState();

constexpr uint8_t kAdTypeFlags = 0x01U;
constexpr uint8_t kAdTypeIncomplete16 = 0x02U;
constexpr uint8_t kAdTypeComplete16 = 0x03U;
constexpr uint8_t kAdTypeIncomplete128 = 0x06U;
constexpr uint8_t kAdTypeComplete128 = 0x07U;
constexpr uint8_t kAdTypeShortName = 0x08U;
constexpr uint8_t kAdTypeCompleteName = 0x09U;
constexpr uint8_t kAdTypeTxPower = 0x0AU;
constexpr uint8_t kAdTypeAppearance = 0x19U;
constexpr uint8_t kAdTypeManufacturer = 0xFFU;
constexpr uint8_t kLedOnState = LOW;
constexpr uint8_t kLedOffState = HIGH;
constexpr uint32_t kForegroundConnectableAdvInterChannelDelayUs = 40U;

constexpr uint16_t kUuidDfuService = 0xFE59U;
constexpr uint16_t kCompanyIdApple = 0x004CU;
constexpr uint16_t kUuidPrimaryService = 0x2800U;
constexpr uint16_t kUuidCharacteristic = 0x2803U;
constexpr uint16_t kUuidClientCharacteristicConfig = 0x2902U;

constexpr uint8_t kAttOpErrorRsp = 0x01U;
constexpr uint8_t kAttOpFindInfoReq = 0x04U;
constexpr uint8_t kAttOpFindInfoRsp = 0x05U;
constexpr uint8_t kAttOpFindByTypeValueReq = 0x06U;
constexpr uint8_t kAttOpFindByTypeValueRsp = 0x07U;
constexpr uint8_t kAttOpReadByTypeReq = 0x08U;
constexpr uint8_t kAttOpReadByTypeRsp = 0x09U;
constexpr uint8_t kAttOpReadReq = 0x0AU;
constexpr uint8_t kAttOpReadRsp = 0x0BU;
constexpr uint8_t kAttOpReadByGroupTypeReq = 0x10U;
constexpr uint8_t kAttOpReadByGroupTypeRsp = 0x11U;
constexpr uint8_t kAttOpWriteReq = 0x12U;
constexpr uint8_t kAttOpWriteRsp = 0x13U;
constexpr uint8_t kAttOpPrepareWriteReq = 0x16U;
constexpr uint8_t kAttOpPrepareWriteRsp = 0x17U;
constexpr uint8_t kAttOpExecuteWriteReq = 0x18U;
constexpr uint8_t kAttOpExecuteWriteRsp = 0x19U;
constexpr uint8_t kAttOpHandleValueNtf = 0x1BU;
constexpr uint8_t kAttErrAttributeNotFound = 0x0AU;

volatile uint32_t g_bluefruitIdleCapAdvZeroDueCount = 0U;
volatile uint32_t g_bluefruitIdleCapAdvPastDueCount = 0U;
volatile uint32_t g_bluefruitIdleCapAdvLeadBusyCount = 0U;
volatile uint32_t g_bluefruitIdleCapAdvSleepCount = 0U;
volatile uint32_t g_bluefruitMaybeAdvertiseCallCount = 0U;
volatile uint32_t g_bluefruitMaybeAdvertiseNotDueCount = 0U;
volatile uint32_t g_bluefruitMaybeAdvertiseEventCount = 0U;
volatile uint32_t g_bluefruitMaybeAdvertiseConnectableEventCount = 0U;
volatile uint32_t g_bluefruitMaybeAdvertiseNonconnEventCount = 0U;
volatile uint32_t g_bluefruitMaybeAdvertiseIntervalUnitsLast = 0U;
volatile uint32_t g_bluefruitMaybeAdvertiseIntervalUnitsMin = 0xFFFFFFFFUL;
volatile uint32_t g_bluefruitMaybeAdvertiseIntervalUnitsMax = 0U;
volatile uint32_t g_bluefruitMaybeAdvertiseGapMinUs = 0xFFFFFFFFUL;
volatile uint32_t g_bluefruitMaybeAdvertiseGapMaxUs = 0U;
volatile uint64_t g_bluefruitMaybeAdvertiseGapTotalUs = 0ULL;
volatile uint64_t g_bluefruitMaybeAdvertiseLastEventUs = 0ULL;
volatile uint32_t g_bluefruitLongWriteDiagCode = 0U;
volatile uint32_t g_bluefruitLongWriteDiagSent = 0U;
volatile uint32_t g_bluefruitLongWriteDiagChunk = 0U;
volatile uint32_t g_bluefruitLongWriteDiagMtu = 0U;
volatile uint32_t g_bluefruitLongWriteDiagDataLength = 0U;
volatile uint32_t g_bluefruitLongWriteDiagWaitOutcome = 0U;
volatile uint32_t g_bluefruitLongWriteDiagAttError = 0U;
volatile uint32_t g_bluefruitLongWriteDiagEventLength = 0U;
volatile uint32_t g_bluefruitLongWriteDiagEventOpcode = 0U;
extern "C" {
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagMagic =
    0x42494447UL;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagFlags = 0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagStage = 0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagMaybeScanCalls =
    0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagActiveScanCalls =
    0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagPassiveScanCalls =
    0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagConnectAttempts =
    0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagConnectionEdgeCount = 0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagDisconnectEdgeCount = 0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagIdleYieldAllowCount = 0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagIdleYieldDenyCount = 0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagDispatchCount =
    0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagLastIdleCapUs =
    0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagLastRemainingUs = 0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagNextScanDeltaUs =
    0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagArmedWakeDeltaUs = 0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagLastIntervalUs =
    0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagLastWindowUs =
    0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagLastDwellBudgetUs = 0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagLastScanRspBudgetUs = 0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagScanStartGapLastUs = 0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagScanStartGapMinUs = 0xFFFFFFFFUL;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagScanStartGapMaxUs = 0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagScanStartGapCount = 0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagLastRole = 0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagLastDisconnectReason = 0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleIdleDiagLastScanResult =
    0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagLastConnectionEdgeMs = 0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagLastPrewarmStartRemainingUs = 0U;
volatile uint32_t __attribute__((used))
    g_bluefruitBleIdleDiagLastPrewarmSource = 0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleScanDiagFlags = 0U;
volatile uint32_t __attribute__((used)) g_bluefruitBleScanDiagUuidSize = 0U;
volatile uint8_t __attribute__((used)) g_bluefruitBleScanDiagLastReportLen = 0U;
volatile uint8_t __attribute__((used)) g_bluefruitBleScanDiagLastReportData[31] = {0};
}

constexpr uint32_t kBluefruitBleIdleDiagFlagStarted = (1UL << 0);
constexpr uint32_t kBluefruitBleIdleDiagFlagConnected = (1UL << 1);
constexpr uint32_t kBluefruitBleIdleDiagFlagScannerRunning = (1UL << 2);
constexpr uint32_t kBluefruitBleIdleDiagFlagScannerPaused = (1UL << 3);
constexpr uint32_t kBluefruitBleIdleDiagFlagScannerCallback = (1UL << 4);
constexpr uint32_t kBluefruitBleIdleDiagFlagActiveScan = (1UL << 5);
constexpr uint32_t kBluefruitBleIdleDiagFlagPendingConnect = (1UL << 6);
constexpr uint32_t kBluefruitBleIdleDiagFlagPendingChannel = (1UL << 7);
constexpr uint32_t kBluefruitBleIdleDiagFlagPrewarmActive = (1UL << 8);
constexpr uint32_t kBluefruitBleIdleDiagFlagWakeArmed = (1UL << 9);
constexpr uint32_t kBluefruitBleIdleDiagFlagCentralSync = (1UL << 10);
constexpr uint32_t kBluefruitBleIdleDiagFlagNextScanDue = (1UL << 11);
constexpr uint32_t kBluefruitBleIdleDiagFlagBackgroundConn = (1UL << 12);

constexpr uint32_t kBluefruitBleScanDiagBuildAdvCalled = (1UL << 0);
constexpr uint32_t kBluefruitBleScanDiagBuildAdvSuccess = (1UL << 1);
constexpr uint32_t kBluefruitBleScanDiagBuildScanRspCalled = (1UL << 2);
constexpr uint32_t kBluefruitBleScanDiagBuildScanRspSuccess = (1UL << 3);
constexpr uint32_t kBluefruitBleScanDiagFilterRssiFail = (1UL << 4);
constexpr uint32_t kBluefruitBleScanDiagFilterUuidFail = (1UL << 5);
constexpr uint32_t kBluefruitBleScanDiagFilterMsdFail = (1UL << 6);
constexpr uint32_t kBluefruitBleScanDiagDispatchSuccess = (1UL << 7);
constexpr uint32_t kBluefruitBleScanDiagActiveCycleReturned = (1UL << 8);
constexpr uint32_t kBluefruitBleScanDiagBuildReportReturned = (1UL << 9);
constexpr uint32_t kBluefruitBleScanDiagBuildScanRspReturned = (1UL << 10);

