lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    if (!radio_.begin()) {
      return false;
    }
    if (Serial.isConfigured()) {
      Serial.forceReInit();
    }
    if (Serial1.isConfigured()) {
      Serial1.forceReInit();
    }
    radio_.loadAddressFromFicr();
    radio_.setAdvertisingPduType(xiao_nrf54l15::BleAdvPduType::kAdvInd);
    radio_.setAdvertisingChannelSelectionAlgorithm2(false);
    radio_.clearCustomGatt();
    radio_.setGattDeviceName(Bluefruit.device_name_);
    radio_.setGattAppearance(Bluefruit.appearance_);
    radio_.setSecurityIoCapabilities(Bluefruit.Security.io_caps_);
    radio_.setPreferredConnectionParameters(Bluefruit.Periph.conn_interval_min_,
                                            Bluefruit.Periph.conn_interval_max_,
                                            Bluefruit.Periph.conn_latency_,
                                            Bluefruit.Periph.conn_supervision_timeout_);
    // Bluefruit defaults to a 23-byte ATT MTU and 27-byte LL data length
    // unless the sketch explicitly chooses a wider bandwidth profile.
    radio_.setPeripheralPreferredAttMtu(Bluefruit.periph_requested_mtu_);
    radio_.setPeripheralPreferredDataLength(
        preferredBleDataLengthFromMtu(Bluefruit.periph_requested_mtu_));
    radio_.setCentralPreferredAttMtu(Bluefruit.central_requested_mtu_);
    radio_.setCentralPreferredDataLength(
        preferredBleDataLengthFromMtu(Bluefruit.central_requested_mtu_));
    radio_.setCustomGattWriteCallback(&BluefruitCompatManager::gattWriteThunk, this);
    (void)Bluefruit.Security.refreshBondedPeerResolving();

    if (Bluefruit.auto_conn_led_) {
      pinMode(LED_BUILTIN, OUTPUT);
      digitalWrite(LED_BUILTIN, kLedOffState);
    }

    started_ = true;
    last_connected_ = radio_.isConnected();
    last_connection_role_ = radio_.connectionRole();
    return true;
  }

  BleRadio& radio() { return radio_; }
  const BleRadio& radio() const { return radio_; }

  void beginCentralSyncProcedure() {
    if (central_sync_procedure_depth_ < 0xFFU) {
      ++central_sync_procedure_depth_;
    }
  }

  void endCentralSyncProcedure() {
    if (central_sync_procedure_depth_ > 0U) {
      --central_sync_procedure_depth_;
    }
  }

  bool centralSyncProcedureActive() const { return central_sync_procedure_depth_ != 0U; }

  void clearCentralScannerTransientState() {
    pending_connect_valid_ = false;
    pending_connect_channel_valid_ = false;
    pending_connect_report_us_ = 0U;
    scan_report_channel_valid_ = false;
    last_connect_attempt_ms_ = 0UL;
  }

  bool stopScanner() {
    const bool wasActive = Bluefruit.Scanner.running_ ||
                           Bluefruit.Scanner.paused_ ||
                           pending_connect_valid_;
    Bluefruit.Scanner.running_ = false;
    Bluefruit.Scanner.paused_ = false;
    Bluefruit.Scanner.timeout_s_ = 0U;
    clearCentralScannerTransientState();
    if (scan_prewarm_active_ && !radio_.isConnected()) {
      radio_.endForegroundUnconnectedRadioActivity();
      scan_prewarm_active_ = false;
    }
    nrf54l15_ble_idle_wake_cancel();
    armed_scan_wake_us_ = 0U;
    next_scan_due_us_ = 0U;
    return wasActive;
  }

  void resetScannerSchedule() {
    if (scan_prewarm_active_ && !radio_.isConnected()) {
      radio_.endForegroundUnconnectedRadioActivity();
      scan_prewarm_active_ = false;
    }
    nrf54l15_ble_idle_wake_cancel();
    armed_scan_wake_us_ = 0U;
    next_scan_due_us_ = 0U;
  }

  bool deferConnectionPhyRequest(uint8_t phy) {
    if (!radio_.isConnected()) {
      return false;
    }
    const uint8_t normalized = normalizeBluefruitPhy(phy);
    if (normalized == BLE_GAP_PHY_AUTO) {
      return false;
    }
    deferred_connection_requested_phy_ = normalized;
    deferred_connection_phy_request_pending_ = true;
    deferred_connection_phy_attempts_ = 0U;
    deferred_connection_phy_next_ms_ =
        millis() + kDeferredPhyRequestInitialDelayMs;
    return true;
  }

  bool deferConnectionDataLengthUpdate() {
    if (!radio_.isConnected()) {
      return false;
    }
    deferred_connection_data_length_request_pending_ = true;
    deferred_connection_data_length_attempts_ = 0U;
    deferred_connection_data_length_next_ms_ =
        millis() + kDeferredLinkRequestInitialDelayMs;
    return true;
  }

  bool deferConnectionMtuExchange(uint16_t mtu) {
    if (!radio_.isConnected()) {
      return false;
    }
    if (mtu < kDefaultAttMtu) {
      mtu = kDefaultAttMtu;
    }
    deferred_connection_requested_mtu_ = mtu;
    deferred_connection_mtu_request_pending_ = true;
    deferred_connection_mtu_attempts_ = 0U;
    deferred_connection_mtu_next_ms_ =
        millis() + kDeferredLinkRequestInitialDelayMs;
    return true;
  }

  void noteExplicitDataLengthRequest() {
    if (!radio_.isConnected()) {
      return;
    }
    const BleConnectionRole role = radio_.connectionRole();
    if (role == BleConnectionRole::kCentral) {
      central_explicit_data_length_request_ = true;
      radio_.setCentralPreferredDataLength(251U);
    } else if (role == BleConnectionRole::kPeripheral) {
      radio_.setPeripheralPreferredDataLength(251U);
    }
  }

  void noteExplicitCentralMtuRequest(uint16_t mtu) {
    if (!radio_.isConnected() ||
        radio_.connectionRole() != BleConnectionRole::kCentral) {
      return;
    }
    if (mtu < kDefaultAttMtu) {
      mtu = kDefaultAttMtu;
    } else if (mtu > 247U) {
      mtu = 247U;
    }
    central_explicit_mtu_request_valid_ = true;
    central_explicit_requested_mtu_ = mtu;
  }

  uint16_t centralAutomaticMtuCeiling() const {
    uint16_t mtu = central_explicit_mtu_request_valid_
                       ? central_explicit_requested_mtu_
                       : Bluefruit.central_requested_mtu_;
    if (mtu < kDefaultAttMtu) {
      mtu = kDefaultAttMtu;
    } else if (mtu > 247U) {
      mtu = 247U;
    }
    return mtu;
  }

  uint16_t centralAutomaticDataLengthCeiling() const {
    if (central_explicit_data_length_request_) {
      return 251U;
    }
    return preferredBleDataLengthFromMtu(centralAutomaticMtuCeiling());
  }

