lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  bool registerCharacteristic(BLECharacteristic* characteristic) {
    if (characteristic == nullptr || characteristic_count_ >= kMaxCharacteristics) {
      return false;
    }
    characteristics_[characteristic_count_++] = characteristic;
    return true;
  }

  bool registerClientCharacteristic(BLEClientCharacteristic* characteristic) {
    if (characteristic == nullptr) {
      return false;
    }
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      if (client_characteristics_[i] == characteristic) {
        return true;
      }
    }
    if (client_characteristic_count_ >= kMaxClientCharacteristics) {
      return false;
    }
    client_characteristics_[client_characteristic_count_++] = characteristic;
    return true;
  }

  void markAdvertisingDirty() {
    Bluefruit.Advertising.dirty_ = true;
    Bluefruit.ScanResponse.dirty_ = true;
  }

  void advertisingStarted() {
    adv_started_ms_ = schedulerTimeMs();
    next_adv_due_us_ = 0U;
    nrf54l15_ble_idle_wake_cancel();
    armed_adv_wake_us_ = 0U;
    nrf54l15_ble_background_radio_release();
    adv_random_state_ = 0U;
  }

  BLEConnection* connection() { return &connection_; }

  bool startRssiMonitor(uint8_t threshold) {
    if (!radio_.isConnected()) {
      return false;
    }
    rssi_monitor_enabled_ = true;
    rssi_monitor_threshold_ = threshold;
    last_reported_rssi_valid_ = radio_.getLatestConnectionRssiDbm(&last_reported_rssi_dbm_);
    return true;
  }

  int8_t currentConnectionRssi() const {
    int8_t rssiDbm = 0;
    if (!radio_.getLatestConnectionRssiDbm(&rssiDbm)) {
      return 0;
    }
    return rssiDbm;
  }

  bool queueCentralConnect(const ble_gap_evt_adv_report_t* report) {
    if (report == nullptr) {
      return false;
    }
    memcpy(pending_connect_address_, report->peer_addr.addr, sizeof(pending_connect_address_));
    pending_connect_channel_valid_ = scan_report_channel_valid_;
    if (pending_connect_channel_valid_) {
      pending_connect_channel_ = scan_report_channel_;
    }
    pending_connect_report_us_ = schedulerTimeUs();
    pending_connect_random_ =
        (report->peer_addr.addr_type != BLE_GAP_ADDR_TYPE_PUBLIC) ? 1U : 0U;
    pending_connect_valid_ = true;
    Bluefruit.Scanner.paused_ = true;
    return maybeConnectCentral();
  }

  void handleCentralConnectionEvent(const BleConnectionEvent& event) {
    if (!(event.packetReceived && event.crcOk && event.attPacket && event.payload != nullptr &&
          event.payloadLength >= 7U)) {
      return;
    }

    const uint8_t attOpcode = event.payload[4];
    if (attOpcode != kAttOpHandleValueNtf) {
      return;
    }

    const uint16_t valueHandle = readLe16(&event.payload[5]);
    const uint16_t valueLength =
        (event.payloadLength >= 7U) ? static_cast<uint16_t>(event.payloadLength - 7U) : 0U;
    const uint8_t* value = &event.payload[7];
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      BLEClientCharacteristic* characteristic = client_characteristics_[i];
      if (characteristic == nullptr || !characteristic->discovered_) {
        continue;
      }
      if (characteristic->value_handle_ == valueHandle) {
        characteristic->handleNotify(value, valueLength);
        return;
      }
    }
  }

  bool primeCentralConnectionBeforeUserCallback() {
    if (!radio_.isConnected() || radio_.connectionRole() != BleConnectionRole::kCentral) {
      return false;
    }

    const unsigned long startMs = millis();
    while (radio_.isConnected() && (millis() - startMs) < 250UL) {
      BleConnectionEvent event{};
      if (radio_.consumeDeferredConnectionEvent(&event) ||
          radio_.pollConnectionEvent(&event, 120000UL)) {
        handleCentralConnectionEvent(event);
        if (event.terminateInd) {
          return false;
        }
        if (event.eventStarted) {
          return true;
        }
      }
      yield();
    }

    return radio_.isConnected();
  }

  void idleService() {
    if (!started_) {
      return;
    }

    const bool connected = radio_.isConnected();
    if (connected != last_connected_) {
      handleConnectionEdge(connected);
      last_connected_ = connected;
    }

    if (!connected) {
      maybeAdvertise();
      maybeScanOrConnect();
    }

    if (connected) {
      const BleConnectionRole role = radio_.connectionRole();
      const bool centralForegroundSetupActive =
          (role == BleConnectionRole::kCentral) &&
          (central_connect_callback_pending_ || centralSyncProcedureActive());
      const bool setupWindowActive =
          static_cast<int32_t>(millis() - last_connection_edge_ms_) <
          static_cast<int32_t>(kBleNoWfiDuringSetupMs);
      const bool backgroundReady =
          !setupWindowActive && !centralForegroundSetupActive;
      if (backgroundReady) {
        if (!radio_.isBackgroundConnectionServiceEnabled()) {
          radio_.setBackgroundConnectionServiceEnabled(true);
        }
      } else if (radio_.isBackgroundConnectionServiceEnabled()) {
        radio_.setBackgroundConnectionServiceEnabled(false);
      }

      maybeApplyDeferredConnectionRequests();
      maybeDispatchRssiUpdate();
      const bool foregroundConnectionPolling =
          !radio_.isBackgroundConnectionServiceEnabled();
      if (radio_.connectionRole() == BleConnectionRole::kPeripheral) {
        if (!radio_.isConnectionEncrypted()) {
          radio_.prefetchConnectionSecurityMaterial(10000UL);
        }
        if (foregroundConnectionPolling) {
          for (uint8_t i = 0U; i < 2U && radio_.isConnected(); ++i) {
            BleConnectionEvent event{};
            if (!radio_.pollConnectionEvent(&event,
                                            kBleIdleConnectionPollBudgetUs)) {
              break;
            }
          }
        }
        maybeDispatchSecurityCallbacks();
        for (uint8_t i = 0U; i < characteristic_count_; ++i) {
          if (characteristics_[i] != nullptr) {
            characteristics_[i]->pollCccdState();
          }
        }
      } else if (radio_.connectionRole() == BleConnectionRole::kCentral) {
        maybeDispatchCentralConnectCallback();
        processCentralBackgroundEvents(4U);
        if (foregroundConnectionPolling) {
          for (uint8_t i = 0U; i < 2U && radio_.isConnected(); ++i) {
            BleConnectionEvent event{};
            if (!radio_.pollConnectionEvent(&event,
                                            kBleIdleConnectionPollBudgetUs)) {
              break;
            }
            handleCentralConnectionEvent(event);
          }
        }
        maybeDispatchSecurityCallbacks();
        dispatchDeferredUserCallbacks();
      }
    }
  }

  uint32_t idleSleepCapUs() const {
    if (!started_) {
      g_bluefruitBleIdleDiagLastIdleCapUs = 0U;
      return 0U;
    }

    if (centralSyncProcedureActive() || pending_connect_valid_) {
      const uint64_t nowUs = schedulerTimeUs();
      updateBleIdleDiagSnapshot(nowUs, kBluefruitBleIdleDiagStagePendingConnect,
                                1U);
      g_bluefruitBleIdleDiagLastIdleCapUs = 1U;
      return 1U;
    }
    if (!radio_.isConnected() &&
        Bluefruit.Scanner.running_ && !Bluefruit.Scanner.paused_ &&
        Bluefruit.Scanner.rx_callback_ != nullptr) {
      if (next_scan_due_us_ == 0U) {
        return 1U;
      }

      const uint64_t nowUs = schedulerTimeUs();
      if (timeReachedUs(nowUs, next_scan_due_us_)) {
        return 1U;
      }

