lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
      const uint64_t remainingUs64 = next_scan_due_us_ - nowUs;
      uint32_t remainingUs = (remainingUs64 > 0xFFFFFFFFULL)
                                 ? 0xFFFFFFFFUL
                                 : static_cast<uint32_t>(remainingUs64);
      const uint32_t wakeLeadUs =
          scan_prewarm_active_ ? kBleScannerReadyLeadUs
                               : kBleScannerPrewarmLeadUs;
      if (remainingUs > wakeLeadUs) {
        remainingUs -= wakeLeadUs;
      } else {
        remainingUs = 1U;
      }
      updateBleIdleDiagSnapshot(nowUs, kBluefruitBleIdleDiagStageScanSleeping,
                                remainingUs);
      g_bluefruitBleIdleDiagLastIdleCapUs = remainingUs;
      return remainingUs;
    }
    if (!radio_.isConnected() && radio_.isBackgroundAdvertisingEnabled()) {
      g_bluefruitBleIdleDiagLastIdleCapUs = 0U;
      return 0U;
    }
    if (!radio_.isConnected() && Bluefruit.Advertising.running_) {
      if (next_adv_due_us_ == 0U) {
        ++g_bluefruitIdleCapAdvZeroDueCount;
        return 1U;
      }

      const uint64_t nowUs = schedulerTimeUs();
      if (timeReachedUs(nowUs, next_adv_due_us_)) {
        ++g_bluefruitIdleCapAdvPastDueCount;
        return 1U;
      }

      const uint64_t remainingUs64 = next_adv_due_us_ - nowUs;
      uint32_t remainingUs = (remainingUs64 > 0xFFFFFFFFULL)
                                 ? 0xFFFFFFFFUL
                                 : static_cast<uint32_t>(remainingUs64);

      // Wake slightly ahead of the deadline so the pump-driven advertising
      // state machine can stage the next event without falling late.
      if (remainingUs > 500U) {
        remainingUs -= 500U;
      } else {
        ++g_bluefruitIdleCapAdvLeadBusyCount;
        remainingUs = 1U;
      }

      ++g_bluefruitIdleCapAdvSleepCount;
      return remainingUs;
    }
    if (radio_.isConnected()) {
      if (radio_.connectionRole() == BleConnectionRole::kCentral &&
          (central_connect_callback_pending_ || centralSyncProcedureActive())) {
        return 1U;
      }
      if (radio_.isBackgroundConnectionServiceEnabled()) {
        const uint64_t nowUs = schedulerTimeUs();
        updateBleIdleDiagSnapshot(nowUs,
                                  kBluefruitBleIdleDiagStageConnectedIdle, 0U);
        g_bluefruitBleIdleDiagLastIdleCapUs = 0U;
        return 0U;
      }
      if ((millis() - last_connection_edge_ms_) < kBleNoWfiDuringSetupMs) {
        const uint64_t nowUs = schedulerTimeUs();
        updateBleIdleDiagSnapshot(nowUs,
                                  kBluefruitBleIdleDiagStageConnectedIdle, 1U);
        g_bluefruitBleIdleDiagLastIdleCapUs = 1U;
        return 1U;
      }
      const uint64_t nowUs = schedulerTimeUs();
      updateBleIdleDiagSnapshot(nowUs, kBluefruitBleIdleDiagStageConnectedIdle,
                                kBleActiveIdleSleepCapUs);
      g_bluefruitBleIdleDiagLastIdleCapUs = kBleActiveIdleSleepCapUs;
      return kBleActiveIdleSleepCapUs;
    }
    g_bluefruitBleIdleDiagLastIdleCapUs = 0U;
    return 0U;
  }

  uint32_t currentBleIdleDiagFlags(uint64_t nowUs) const {
    uint32_t flags = 0U;
    if (started_) {
      flags |= kBluefruitBleIdleDiagFlagStarted;
    }
    if (radio_.isConnected()) {
      flags |= kBluefruitBleIdleDiagFlagConnected;
    }
    if (Bluefruit.Scanner.running_) {
      flags |= kBluefruitBleIdleDiagFlagScannerRunning;
    }
    if (Bluefruit.Scanner.paused_) {
      flags |= kBluefruitBleIdleDiagFlagScannerPaused;
    }
    if (Bluefruit.Scanner.rx_callback_ != nullptr) {
      flags |= kBluefruitBleIdleDiagFlagScannerCallback;
    }
    if (Bluefruit.Scanner.active_scan_) {
      flags |= kBluefruitBleIdleDiagFlagActiveScan;
    }
    if (pending_connect_valid_) {
      flags |= kBluefruitBleIdleDiagFlagPendingConnect;
    }
    if (pending_connect_channel_valid_) {
      flags |= kBluefruitBleIdleDiagFlagPendingChannel;
    }
    if (scan_prewarm_active_) {
      flags |= kBluefruitBleIdleDiagFlagPrewarmActive;
    }
    if (armed_scan_wake_us_ != 0U) {
      flags |= kBluefruitBleIdleDiagFlagWakeArmed;
    }
    if (centralSyncProcedureActive()) {
      flags |= kBluefruitBleIdleDiagFlagCentralSync;
    }
    if ((next_scan_due_us_ != 0U) && !timeReachedUs(nowUs, next_scan_due_us_)) {
      flags |= kBluefruitBleIdleDiagFlagNextScanDue;
    }
    if (radio_.isBackgroundConnectionServiceEnabled()) {
      flags |= kBluefruitBleIdleDiagFlagBackgroundConn;
    }
    return flags;
  }

  void updateBleIdleDiagSnapshot(uint64_t nowUs, uint32_t stage,
                                 uint32_t remainingUs) const {
    g_bluefruitBleIdleDiagFlags = currentBleIdleDiagFlags(nowUs);
    g_bluefruitBleIdleDiagStage = stage;
    g_bluefruitBleIdleDiagLastRemainingUs = remainingUs;
    g_bluefruitBleIdleDiagLastRole =
        static_cast<uint32_t>(radio_.connectionRole());
    g_bluefruitBleIdleDiagLastConnectionEdgeMs = last_connection_edge_ms_;

    if ((next_scan_due_us_ != 0U) && !timeReachedUs(nowUs, next_scan_due_us_)) {
      const uint64_t nextDeltaUs64 = next_scan_due_us_ - nowUs;
      g_bluefruitBleIdleDiagNextScanDeltaUs =
          (nextDeltaUs64 > 0xFFFFFFFFULL)
              ? 0xFFFFFFFFUL
              : static_cast<uint32_t>(nextDeltaUs64);
    } else {
      g_bluefruitBleIdleDiagNextScanDeltaUs = 0U;
    }

    if ((armed_scan_wake_us_ != 0U) && !timeReachedUs(nowUs, armed_scan_wake_us_)) {
      const uint64_t armedDeltaUs64 = armed_scan_wake_us_ - nowUs;
      g_bluefruitBleIdleDiagArmedWakeDeltaUs =
          (armedDeltaUs64 > 0xFFFFFFFFULL)
              ? 0xFFFFFFFFUL
              : static_cast<uint32_t>(armedDeltaUs64);
    } else {
      g_bluefruitBleIdleDiagArmedWakeDeltaUs = 0U;
    }
  }

  bool idleYieldWfiAllowed() const {
    if (!started_) {
      ++g_bluefruitBleIdleDiagIdleYieldDenyCount;
      return false;
    }
    if (Serial.isConfigured() || Serial1.isConfigured()) {
      // Keep Serial monitor sketches pump-driven. The SAMD11 bridge UART is
      // not a reliable wake source while foreground BLE scan windows are being
      // scheduled, so WFI here can make central scan examples look dead.
      ++g_bluefruitBleIdleDiagIdleYieldDenyCount;
      return false;
    }
    if (radio_.isConnected()) {
      if (radio_.isBackgroundConnectionServiceEnabled()) {
        // Background service handles connection events, permit WFI
        ++g_bluefruitBleIdleDiagIdleYieldAllowCount;
        return true;
      }
      ++g_bluefruitBleIdleDiagIdleYieldDenyCount;
      return false;
    }
    if (centralSyncProcedureActive() || pending_connect_valid_) {
      ++g_bluefruitBleIdleDiagIdleYieldDenyCount;
      return false;
    }
    // Permit WFI during advertising if background mode handles events
    if (Bluefruit.Advertising.running_ && radio_.isBackgroundAdvertisingEnabled()) {
      ++g_bluefruitBleIdleDiagIdleYieldAllowCount;
      return true;
    }
    // Permit WFI during foreground advertising when wake is armed
    if (Bluefruit.Advertising.running_ && armed_adv_wake_us_ != 0U &&
        !timeReachedUs(schedulerTimeUs(), armed_adv_wake_us_)) {
      ++g_bluefruitBleIdleDiagIdleYieldAllowCount;
      return true;
    }
    if (!Bluefruit.Scanner.running_ || Bluefruit.Scanner.paused_ ||
        Bluefruit.Scanner.rx_callback_ == nullptr) {
      ++g_bluefruitBleIdleDiagIdleYieldDenyCount;
      return false;
    }
    if (next_scan_due_us_ == 0U || armed_scan_wake_us_ == 0U) {
      ++g_bluefruitBleIdleDiagIdleYieldDenyCount;
      return false;
    }

    const uint64_t nowUs = schedulerTimeUs();
    if (timeReachedUs(nowUs, next_scan_due_us_)) {
      ++g_bluefruitBleIdleDiagIdleYieldDenyCount;
      return false;
    }

