lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    const uint64_t remainingUs64 = next_scan_due_us_ - nowUs;
    const uint32_t remainingUs =
        (remainingUs64 > 0xFFFFFFFFULL)
            ? 0xFFFFFFFFUL
            : static_cast<uint32_t>(remainingUs64);
    const uint32_t wakeLeadUs =
        scan_prewarm_active_ ? kBleScannerReadyLeadUs
                             : kBleScannerPrewarmLeadUs;
    const bool allowed = remainingUs > wakeLeadUs;
    if (allowed) {
      ++g_bluefruitBleIdleDiagIdleYieldAllowCount;
    } else {
      ++g_bluefruitBleIdleDiagIdleYieldDenyCount;
    }
    updateBleIdleDiagSnapshot(nowUs, kBluefruitBleIdleDiagStageScanSleeping,
                              remainingUs);
    return allowed;
  }

  void dispatchDeferredUserCallbacks() {
    if (ScopedBluefruitUserCallback::active()) {
      return;
    }
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      BLEClientCharacteristic* characteristic = client_characteristics_[i];
      if (characteristic != nullptr) {
        characteristic->dispatchPendingNotify();
      }
    }
  }

  void maybeDispatchCentralConnectCallback() {
    if (!central_connect_callback_pending_ ||
        Bluefruit.Central.connect_callback_ == nullptr ||
        !radio_.isConnected() ||
        radio_.connectionRole() != BleConnectionRole::kCentral) {
      return;
    }
    if (static_cast<int32_t>(millis() - central_connect_callback_not_before_ms_) < 0) {
      return;
    }

    central_connect_callback_pending_ = false;
    central_connect_callback_not_before_ms_ = 0UL;
    invokeBluefruitUserCallback(Bluefruit.Central.connect_callback_, 0U);
    // After the user callback (which may stall for seconds), resynchronize
    // the central's event counter/channel with the peripheral. The callback
    // blocks polling, so the central falls behind and ends up on the wrong
    // channel. Poll until we get a CRC-OK event to confirm alignment.
    // Do NOT pre-advance the counter — the central's timer drifts from the
    // peripheral's, so a calculated catch-up can overshoot. Instead, walk
    // through events one at a time; pollCentralConnectionEvent waits for
    // each event (advancing 1/event) so the central naturally locks on.
    if (radio_.isConnected() && radio_.connectionRole() == BleConnectionRole::kCentral) {
      const unsigned long resyncStartMs = millis();
      while (radio_.isConnected() && (millis() - resyncStartMs) < 5000UL) {
        BleConnectionEvent event{};
        if (radio_.pollConnectionEvent(&event, 120000UL)) {
          handleCentralConnectionEvent(event);
          if (event.terminateInd) break;
          if (event.eventStarted && event.crcOk && event.packetReceived) {
            break;  // Channel aligned
          }
        }
        // No delay needed — pollCentralConnectionEvent already waits for the
        // next event when late, advancing the counter 1/event to match the
        // peripheral's rate. Adding delay would make the central lag behind.
      }
    }
  }

 private:
  static constexpr uint8_t kMaxCharacteristics = 24U;
  static constexpr uint8_t kMaxClientCharacteristics = 16U;
  static constexpr uint16_t kDefaultDataLength = 27U;
  static constexpr uint16_t kDefaultAttMtu = 23U;
  static constexpr uint32_t kScannerMinIntervalUs = 2500UL;
  static constexpr uint32_t kScannerMinWindowUs = 2500UL;
  static constexpr uint32_t kScannerMinRestUs = 1000UL;
  static constexpr uint32_t kScannerMinDwellBudgetUs = 2500UL;
  static constexpr uint32_t kScannerMaxDwellBudgetUs = 30000UL;
  static constexpr uint32_t kScannerScanRspBudgetUs = 2500UL;
  static constexpr uint32_t kCentralConnectCandidateMaxAgeUs = 200000UL;
  static constexpr uint32_t kCentralConnectMinBudgetUs = 180000UL;
  static constexpr uint32_t kCentralConnectMaxBudgetUs = 220000UL;
  static constexpr uint16_t kDeferredDataLengthTarget =
      static_cast<uint16_t>(BleRadio::kCustomGattMaxValueLength + 7U);
  static constexpr unsigned long kDeferredPhyRequestInitialDelayMs = 1500UL;
  static constexpr unsigned long kDeferredLinkRequestInitialDelayMs = 250UL;
  static constexpr unsigned long kDeferredLinkRequestRetryMs = 500UL;
  static constexpr uint8_t kDeferredLinkRequestMaxAttempts = 20U;

  uint32_t foregroundAdvertisingRandomDelayUs() {
    if (adv_random_state_ == 0U) {
      adv_random_state_ =
          static_cast<uint32_t>(schedulerTimeUs()) ^ 0x5A17B1E5UL;
    }
    adv_random_state_ = adv_random_state_ * 1103515245UL + 12345UL;
    return adv_random_state_ % 10001UL;
  }

  static uint32_t scannerUnitsToUs(uint16_t units) {
    const uint32_t us = static_cast<uint32_t>(units) * 625UL;
    return (us < kScannerMinIntervalUs) ? kScannerMinIntervalUs : us;
  }

  uint32_t scannerIntervalUs() const {
    const bool useLowPower =
        Bluefruit.Scanner.low_power_after_ms_ != 0U &&
        Bluefruit.Scanner.low_power_interval_ != 0U &&
        ((schedulerTimeMs() - Bluefruit.Scanner.started_ms_) >=
         Bluefruit.Scanner.low_power_after_ms_);
    return scannerUnitsToUs(useLowPower ? Bluefruit.Scanner.low_power_interval_
                                        : Bluefruit.Scanner.interval_);
  }

  uint32_t scannerWindowUs(uint32_t intervalUs) const {
    const bool useLowPower =
        Bluefruit.Scanner.low_power_after_ms_ != 0U &&
        Bluefruit.Scanner.low_power_window_ != 0U &&
        ((schedulerTimeMs() - Bluefruit.Scanner.started_ms_) >=
         Bluefruit.Scanner.low_power_after_ms_);
    uint32_t windowUs = scannerUnitsToUs(useLowPower ? Bluefruit.Scanner.low_power_window_
                                                     : Bluefruit.Scanner.window_);
    if (windowUs > intervalUs) {
      windowUs = intervalUs;
    }
    return (windowUs < kScannerMinWindowUs) ? kScannerMinWindowUs : windowUs;
  }

  uint32_t scannerDwellBudgetUs(uint32_t windowUs) const {
    // The budgeted scan path listens on one advertising channel per scheduled
    // window and rotates channels. Keep the dwell aligned to the configured
    // Bluefruit scan window instead of approximating it with spin loops.
    uint32_t dwellUs = windowUs;
    if (dwellUs < kScannerMinDwellBudgetUs) {
      dwellUs = kScannerMinDwellBudgetUs;
    } else if (dwellUs > kScannerMaxDwellBudgetUs) {
      dwellUs = kScannerMaxDwellBudgetUs;
    }
    return dwellUs;
  }

  uint32_t scannerScanRspBudgetUs(uint32_t dwellBudgetUs) const {
    return (dwellBudgetUs < kScannerScanRspBudgetUs) ? dwellBudgetUs
                                                     : kScannerScanRspBudgetUs;
  }

