lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    const uint32_t intervalUs = scannerIntervalUs();
    const uint32_t windowUs = scannerWindowUs(intervalUs);
    const uint32_t dwellBudgetUs = scannerDwellBudgetUs(windowUs);
    const uint32_t scanRspBudgetUs = scannerScanRspBudgetUs(dwellBudgetUs);
    g_bluefruitBleIdleDiagLastIntervalUs = intervalUs;
    g_bluefruitBleIdleDiagLastWindowUs = windowUs;
    g_bluefruitBleIdleDiagLastDwellBudgetUs = dwellBudgetUs;
    g_bluefruitBleIdleDiagLastScanRspBudgetUs = scanRspBudgetUs;
    if (scan_start_last_us_ != 0U) {
      const uint32_t gapUs =
          static_cast<uint32_t>(nowUs - scan_start_last_us_);
      g_bluefruitBleIdleDiagScanStartGapLastUs = gapUs;
      if (gapUs < g_bluefruitBleIdleDiagScanStartGapMinUs) {
        g_bluefruitBleIdleDiagScanStartGapMinUs = gapUs;
      }
      if (gapUs > g_bluefruitBleIdleDiagScanStartGapMaxUs) {
        g_bluefruitBleIdleDiagScanStartGapMaxUs = gapUs;
      }
      ++g_bluefruitBleIdleDiagScanStartGapCount;
    }
    scan_start_last_us_ = nowUs;
    updateBleIdleDiagSnapshot(nowUs, kBluefruitBleIdleDiagStageScanRunning, 0U);
    next_scan_due_us_ = nowUs + intervalUs;

    bool gotReport = false;
    if (Bluefruit.Scanner.active_scan_) {
      ++g_bluefruitBleIdleDiagActiveScanCalls;
      g_bluefruitBleIdleDiagStage = kBluefruitBleIdleDiagStageActiveScan;
      const uint64_t scanDeadlineUs = nowUs + dwellBudgetUs;
      while (!pending_connect_valid_ && Bluefruit.Scanner.running_ &&
             !Bluefruit.Scanner.paused_ &&
             !timeReachedUs(schedulerTimeUs(), scanDeadlineUs)) {
        const uint64_t loopNowUs = schedulerTimeUs();
        const uint64_t remainingUs64 = scanDeadlineUs - loopNowUs;
        const uint32_t remainingUs =
            (remainingUs64 > 0xFFFFFFFFULL)
                ? 0xFFFFFFFFUL
                : static_cast<uint32_t>(remainingUs64);
        xiao_nrf54l15::BleActiveScanResult result{};
        if (!radio_.scanActiveCycleBudgeted(&result, remainingUs,
                                            scanRspBudgetUs)) {
          break;
        }
        g_bluefruitBleScanDiagFlags |=
            kBluefruitBleScanDiagActiveCycleReturned;
        if (buildScanReport(result, false)) {
          g_bluefruitBleScanDiagFlags |=
              kBluefruitBleScanDiagBuildReportReturned;
          gotReport = true;
          if (dispatchCurrentScanReport()) {
            break;
          }
        }
        if (!pending_connect_valid_ && Bluefruit.Scanner.running_ &&
            Bluefruit.Scanner.rx_callback_ != nullptr &&
            buildScanReport(result, true)) {
          g_bluefruitBleScanDiagFlags |=
              kBluefruitBleScanDiagBuildScanRspReturned;
          gotReport = true;
          if (dispatchCurrentScanReport()) {
            break;
          }
        }
      }
      g_bluefruitBleIdleDiagLastScanResult = gotReport ? 1U : 0U;
    } else {
      ++g_bluefruitBleIdleDiagPassiveScanCalls;
      g_bluefruitBleIdleDiagStage = kBluefruitBleIdleDiagStagePassiveScan;
      const uint64_t scanDeadlineUs = nowUs + dwellBudgetUs;
      while (!pending_connect_valid_ && Bluefruit.Scanner.running_ &&
             !Bluefruit.Scanner.paused_ &&
             !timeReachedUs(schedulerTimeUs(), scanDeadlineUs)) {
        const uint64_t loopNowUs = schedulerTimeUs();
        const uint64_t remainingUs64 = scanDeadlineUs - loopNowUs;
        const uint32_t remainingUs =
            (remainingUs64 > 0xFFFFFFFFULL)
                ? 0xFFFFFFFFUL
                : static_cast<uint32_t>(remainingUs64);
        xiao_nrf54l15::BleScanPacket packet{};
        if (!radio_.scanCycleBudgeted(&packet, remainingUs)) {
          break;
        }
        if (buildScanReport(packet)) {
          gotReport = true;
          if (dispatchCurrentScanReport()) {
            break;
          }
        }
      }
      g_bluefruitBleIdleDiagLastScanResult = gotReport ? 2U : 0U;
    }

    const uint64_t afterUs = schedulerTimeUs();
    if (timeReachedUs(afterUs, next_scan_due_us_)) {
      const uint32_t restUs =
          (intervalUs > windowUs) ? (intervalUs - windowUs) : kScannerMinRestUs;
      next_scan_due_us_ = afterUs + restUs;
    }
    // Arm the wake after the scan completes so idleYieldWfiAllowed()
    // can permit WFI between scan windows. The wake is canceled at the
    // top of the scan path (line 1757-1759), so it must be re-armed here.
    // Use the short ready-lead (80us) instead of prewarm-lead (650us)
    // to avoid the HFXO prewarm spike on each scan cycle.
    // Also shut down the HFXO before sleeping to avoid sustained draw.
    if (armed_scan_wake_us_ == 0U && next_scan_due_us_ != 0U) {
      const uint32_t wakeLeadUs = kBleScannerReadyLeadUs;
      const uint64_t scanWakeUs =
          (next_scan_due_us_ > static_cast<uint64_t>(wakeLeadUs))
              ? static_cast<uint64_t>(next_scan_due_us_ - wakeLeadUs)
              : next_scan_due_us_;
      // Power down HFXO before arming the wake
      if (scan_prewarm_active_) {
        radio_.endForegroundUnconnectedRadioActivity();
        scan_prewarm_active_ = false;
      }
      nrf54l15_ble_idle_wake_arm(static_cast<uint32_t>(scanWakeUs));
      armed_scan_wake_us_ = static_cast<uint64_t>(scanWakeUs);
    }
  }

  void maybeApplyCentralLinkConfig() {
    if (!radio_.isConnected() || radio_.connectionRole() != BleConnectionRole::kCentral) {
      return;
    }
    if (centralSyncProcedureActive()) {
      return;
    }
    if (static_cast<int32_t>(millis() - central_link_config_not_before_ms_) < 0) {
      return;
    }

    if (central_data_length_request_pending_) {
      if (radio_.dataLengthUpdateComplete() ||
          (radio_.currentDataLength() >=
           static_cast<uint16_t>(BleRadio::kCustomGattMaxValueLength + 7U)) ||
          radio_.requestDataLengthUpdate()) {
        central_data_length_request_pending_ = false;
      }
    }

    if (central_mtu_request_pending_) {
      const uint16_t mtu = Bluefruit.central_requested_mtu_;
      if ((mtu <= 23U) || radio_.attMtuExchangeComplete() ||
          (radio_.currentAttMtu() >= mtu) ||
          radio_.requestAttMtuExchange(mtu)) {
        central_mtu_request_pending_ = false;
      }
    }
  }

  void maybeApplyDeferredConnectionRequests() {
    if (!radio_.isConnected() || centralSyncProcedureActive()) {
      return;
    }

    const unsigned long now = millis();

    if (deferred_connection_phy_request_pending_) {
      const uint8_t phy = deferred_connection_requested_phy_;
      const uint8_t currentPhy = radio_.getPHY();
      if (currentPhy == phy) {
        deferred_connection_phy_request_pending_ = false;
        deferred_connection_requested_phy_ = BLE_GAP_PHY_AUTO;
        deferred_connection_phy_attempts_ = 0U;
        deferred_connection_phy_next_ms_ = 0UL;
        if (radio_.currentDataLength() <= kDefaultDataLength) {
          deferred_connection_data_length_request_pending_ = true;
          deferred_connection_data_length_attempts_ = 0U;
          deferred_connection_data_length_next_ms_ =
              now + kDeferredLinkRequestRetryMs;
        }
        if ((deferred_connection_requested_mtu_ > kDefaultAttMtu) &&
            (radio_.currentAttMtu() < deferred_connection_requested_mtu_)) {
          deferred_connection_mtu_request_pending_ = true;
          deferred_connection_mtu_attempts_ = 0U;
          deferred_connection_mtu_next_ms_ =
              now + kDeferredLinkRequestRetryMs;
        }
      } else if (deferred_connection_phy_attempts_ >=
                 kDeferredLinkRequestMaxAttempts) {
        deferred_connection_phy_request_pending_ = false;
        deferred_connection_requested_phy_ = BLE_GAP_PHY_AUTO;
        deferred_connection_phy_attempts_ = 0U;
        deferred_connection_phy_next_ms_ = 0UL;
      } else if (static_cast<int32_t>(now - deferred_connection_phy_next_ms_) >= 0) {
        (void)radio_.requestPHY(phy);
        ++deferred_connection_phy_attempts_;
        deferred_connection_phy_next_ms_ = now + kDeferredLinkRequestRetryMs;
      }
    }

    if (deferred_connection_data_length_request_pending_) {
      const uint16_t dataLength = radio_.currentDataLength();
      if (dataLength >= kDeferredDataLengthTarget ||
          dataLength > kDefaultDataLength) {
        deferred_connection_data_length_request_pending_ = false;
        deferred_connection_data_length_attempts_ = 0U;
        deferred_connection_data_length_next_ms_ = 0UL;
      } else if (deferred_connection_data_length_attempts_ >=
                 kDeferredLinkRequestMaxAttempts) {
        deferred_connection_data_length_request_pending_ = false;
        deferred_connection_data_length_attempts_ = 0U;
        deferred_connection_data_length_next_ms_ = 0UL;
      } else if (static_cast<int32_t>(
                     now - deferred_connection_data_length_next_ms_) >= 0) {
        (void)radio_.requestDataLengthUpdate();
        ++deferred_connection_data_length_attempts_;
        deferred_connection_data_length_next_ms_ =
            now + kDeferredLinkRequestRetryMs;
      }
    }

    if (deferred_connection_mtu_request_pending_) {
      const uint16_t mtu = deferred_connection_requested_mtu_;
      const uint16_t currentMtu = radio_.currentAttMtu();
      // Callback-time requestMtuExchange(23) still needs a real ATT_MTU_REQ
      // even though the connection starts at 23. Otherwise a later automatic
      // request from the peer can raise the MTU and the user's "keep it at 23"
      // request was never actually negotiated on-air.
      if (radio_.attMtuExchangeComplete() && (currentMtu == mtu)) {
        deferred_connection_mtu_request_pending_ = false;
        deferred_connection_requested_mtu_ = kDefaultAttMtu;
        deferred_connection_mtu_attempts_ = 0U;
        deferred_connection_mtu_next_ms_ = 0UL;
      } else if (deferred_connection_mtu_attempts_ >=
                 kDeferredLinkRequestMaxAttempts) {
        deferred_connection_mtu_request_pending_ = false;
        deferred_connection_requested_mtu_ = kDefaultAttMtu;
        deferred_connection_mtu_attempts_ = 0U;
        deferred_connection_mtu_next_ms_ = 0UL;
      } else if (static_cast<int32_t>(now - deferred_connection_mtu_next_ms_) >= 0) {
        (void)radio_.requestAttMtuExchange(mtu);
        ++deferred_connection_mtu_attempts_;
        deferred_connection_mtu_next_ms_ = now + kDeferredLinkRequestRetryMs;
      }
    }
  }

