lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
uint8_t BLESecurity::resolvingListCount() const {
  return resolving_list_count_;
}

uint8_t BLESecurity::resolvingListCapacity() const {
  return kResolvingListMaxEntries;
}

bool BLESecurity::addResolvingIrk(const uint8_t irk[16]) {
  if (irk == nullptr) {
    return false;
  }

  for (uint8_t i = 0U; i < resolving_list_count_; ++i) {
    if (memcmp(resolving_list_irks_[i], irk, 16U) == 0) {
      return true;
    }
  }

  if (resolving_list_count_ >= kResolvingListMaxEntries) {
    return false;
  }

  memcpy(resolving_list_irks_[resolving_list_count_], irk, 16U);
  ++resolving_list_count_;
  return true;
}

bool BLESecurity::addBondedPeerIrkToResolvingList() {
  uint8_t irk[16] = {0};
  if (!getBondPeerIrk(irk)) {
    return false;
  }
  return addResolvingIrk(irk);
}

bool BLESecurity::setBondedPeerResolvingEnabled(bool enabled) {
  auto_bonded_peer_resolving_ = enabled;
  if (!enabled) {
    return true;
  }
  (void)refreshBondedPeerResolving();
  return true;
}

bool BLESecurity::bondedPeerResolvingEnabled() const {
  return auto_bonded_peer_resolving_;
}

bool BLESecurity::refreshBondedPeerResolving() {
  if (!auto_bonded_peer_resolving_) {
    return false;
  }
  return addBondedPeerIrkToResolvingList();
}

bool BLESecurity::removeResolvingIrk(uint8_t index) {
  if (index >= resolving_list_count_) {
    return false;
  }

  for (uint8_t i = index; (i + 1U) < resolving_list_count_; ++i) {
    memcpy(resolving_list_irks_[i], resolving_list_irks_[i + 1U], 16U);
  }
  --resolving_list_count_;
  memset(resolving_list_irks_[resolving_list_count_], 0, 16U);
  return true;
}

bool BLESecurity::getResolvingIrk(uint8_t index, uint8_t irkOut[16]) const {
  if (index >= resolving_list_count_ || irkOut == nullptr) {
    return false;
  }

  memcpy(irkOut, resolving_list_irks_[index], 16U);
  return true;
}

bool BLESecurity::resolveResolvablePrivateAddress(const uint8_t address[6],
                                                  bool* outResolved,
                                                  uint16_t* outIndex) const {
  if (outResolved != nullptr) {
    *outResolved = false;
  }
  if (outIndex != nullptr) {
    *outIndex = 0xFFFFU;
  }
  if (resolving_list_count_ == 0U) {
    return false;
  }

  return manager().radio().resolveResolvablePrivateAddress(
      address, &resolving_list_irks_[0][0], resolving_list_count_,
      outResolved, outIndex);
}

void BLESecurity::setOobDataRequestCallback(oob_data_request_callback_t fp) {
  oob_data_request_callback_ = fp;
}

void serviceBluefruitBeforePollingState() {
  if (ScopedBluefruitUserCallback::active()) {
    return;
  }
  manager().idleService();
  manager().dispatchDeferredUserCallbacks();
}

static constexpr unsigned long kLinkCapacityWaitTimeoutMs = 2000UL;
static constexpr unsigned long kLinkCapacityRetryMs = 100UL;

bool linkValueFitsCurrentConnection(uint16_t valueLen) {
  if (!manager().radio().isConnected()) {
    return false;
  }

  const uint16_t requiredAttMtu = static_cast<uint16_t>(3U + valueLen);
  const uint16_t requiredDataLength = static_cast<uint16_t>(7U + valueLen);
  return (manager().radio().currentAttMtu() >= requiredAttMtu) &&
         (manager().radio().currentDataLength() >= requiredDataLength);
}

bool waitForLinkValueCapacity(uint16_t valueLen,
                              unsigned long timeoutMs = kLinkCapacityWaitTimeoutMs) {
  if (!manager().radio().isConnected()) {
    return false;
  }

  const uint16_t requiredAttMtu = static_cast<uint16_t>(3U + valueLen);
  const uint16_t requiredDataLength = static_cast<uint16_t>(7U + valueLen);
  if (linkValueFitsCurrentConnection(valueLen)) {
    return true;
  }
  if ((requiredAttMtu <= 23U) && (requiredDataLength <= 27U)) {
    return true;
  }
  if ((requiredAttMtu > manager().centralAutomaticMtuCeiling()) ||
      (requiredDataLength > manager().centralAutomaticDataLengthCeiling())) {
    return false;
  }

  unsigned long nextDataLengthRequestMs = 0UL;
  unsigned long nextMtuRequestMs = 0UL;
  const unsigned long startMs = millis();
  while (manager().radio().isConnected() &&
         (millis() - startMs) < timeoutMs) {
    if (linkValueFitsCurrentConnection(valueLen)) {
      return true;
    }

    const unsigned long nowMs = millis();
    if (!ScopedBluefruitUserCallback::active()) {
      if ((manager().radio().currentDataLength() < requiredDataLength) &&
          static_cast<long>(nowMs - nextDataLengthRequestMs) >= 0) {
        (void)manager().radio().requestDataLengthUpdate();
        nextDataLengthRequestMs = nowMs + kLinkCapacityRetryMs;
      }
      if ((manager().radio().currentAttMtu() < requiredAttMtu) &&
          static_cast<long>(nowMs - nextMtuRequestMs) >= 0) {
        const uint16_t requestedMtu = min<uint16_t>(247U, requiredAttMtu);
        (void)manager().radio().requestAttMtuExchange(requestedMtu);
        nextMtuRequestMs = nowMs + kLinkCapacityRetryMs;
      }
    }

    manager().idleService();
    yield();
  }

  return linkValueFitsCurrentConnection(valueLen);
}

class ScopedCentralSyncProcedure {
 public:
  ScopedCentralSyncProcedure() { manager().beginCentralSyncProcedure(); }
  ~ScopedCentralSyncProcedure() { manager().endCentralSyncProcedure(); }
};

BLEService* BLEService::lastService = nullptr;
BLEClientService* BLEClientService::lastService = nullptr;
AdafruitBluefruit Bluefruit;
const uint8_t BLEUART_UUID_SERVICE[16] = {0x9EU, 0xCAU, 0xDCU, 0x24U, 0x0EU, 0xE5U,
                                          0xA9U, 0xE0U, 0x93U, 0xF3U, 0xA3U, 0xB5U,
                                          0x01U, 0x00U, 0x40U, 0x6EU};
const uint8_t BLEUART_UUID_CHR_RXD[16] = {0x9EU, 0xCAU, 0xDCU, 0x24U, 0x0EU, 0xE5U,
                                          0xA9U, 0xE0U, 0x93U, 0xF3U, 0xA3U, 0xB5U,
                                          0x02U, 0x00U, 0x40U, 0x6EU};
const uint8_t BLEUART_UUID_CHR_TXD[16] = {0x9EU, 0xCAU, 0xDCU, 0x24U, 0x0EU, 0xE5U,
                                          0xA9U, 0xE0U, 0x93U, 0xF3U, 0xA3U, 0xB5U,
                                          0x03U, 0x00U, 0x40U, 0x6EU};

enum class AttWaitOutcome : uint8_t {
  kResponse = 0,
  kError = 1,
  kDisconnected = 2,
  kTimeout = 3,
};

struct AttWaitResult {
  AttWaitOutcome outcome;
  BleConnectionEvent event;
  uint8_t errorCode;
};

bool centralReady(uint16_t connHandle) {
  return connHandle == 0U && manager().radio().isConnected() &&
         manager().radio().connectionRole() == BleConnectionRole::kCentral;
}

template <typename Attempt>
bool retryCentralProcedure(Attempt attempt, uint8_t maxAttempts = 10U,
                           unsigned long retryDelayMs = 300UL) {
  if (!manager().radio().isConnected() ||
      manager().radio().connectionRole() != BleConnectionRole::kCentral) {
    return false;
  }

  if (maxAttempts == 0U) {
    maxAttempts = 1U;
  }

  for (uint8_t attemptIndex = 0U; attemptIndex < maxAttempts; ++attemptIndex) {
    if (attempt()) {
      return true;
    }
    if (!manager().radio().isConnected() ||
        manager().radio().connectionRole() != BleConnectionRole::kCentral) {
      return false;
    }
    if ((attemptIndex + 1U) >= maxAttempts || retryDelayMs == 0UL) {
      continue;
    }

    const unsigned long delayStartMs = millis();
    while ((millis() - delayStartMs) < retryDelayMs) {
      if (!manager().radio().isConnected() ||
          manager().radio().connectionRole() != BleConnectionRole::kCentral) {
        return false;
      }
      yield();
    }
  }

