lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  return false;
}

bool nextCentralEvent(BleConnectionEvent* event, uint32_t timeoutMs = 800UL) {
  if (event == nullptr) {
    return false;
  }

  const unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    if (manager().radio().consumeDeferredConnectionEvent(event)) {
      return true;
    }
    if (!manager().radio().isConnected()) {
      return false;
    }
    if (manager().radio().pollConnectionEvent(event, 120000UL)) {
      return true;
    }
  }
  return false;
}

template <typename QueueAttempt>
bool queueCentralAttProcedure(QueueAttempt queueAttempt, uint32_t timeoutMs = 1000UL) {
  if (!manager().radio().isConnected()) {
    return false;
  }

  const unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    if (queueAttempt()) {
      return true;
    }
    if (!manager().radio().isConnected()) {
      return false;
    }

    BleConnectionEvent event{};
    if (!nextCentralEvent(&event, 24UL)) {
      yield();
      continue;
    }

    if (event.terminateInd) {
      return false;
    }
    manager().handleCentralConnectionEvent(event);
  }

  return false;
}

AttWaitResult waitForAttOpcode(uint8_t requestOpcode, uint8_t responseOpcode,
                               uint32_t timeoutMs = 1000UL) {
  AttWaitResult result{};
  result.outcome = AttWaitOutcome::kTimeout;
  result.errorCode = 0U;

  const unsigned long startMs = millis();
  while ((millis() - startMs) < timeoutMs) {
    BleConnectionEvent event{};
    if (!nextCentralEvent(&event, 120UL)) {
      if (!manager().radio().isConnected()) {
        result.outcome = AttWaitOutcome::kDisconnected;
        return result;
      }
      continue;
    }

    if (event.terminateInd) {
      result.outcome = AttWaitOutcome::kDisconnected;
      result.event = event;
      return result;
    }

    if (!(event.packetReceived && event.crcOk && event.attPacket &&
          event.payload != nullptr && event.payloadLength >= 5U)) {
      manager().handleCentralConnectionEvent(event);
      continue;
    }

    const uint8_t attOpcode = event.payload[4];
    if (attOpcode == kAttOpHandleValueNtf) {
      manager().handleCentralConnectionEvent(event);
      continue;
    }

    if (attOpcode == kAttOpErrorRsp && event.payloadLength >= 9U) {
      if (event.payload[5] == requestOpcode) {
        result.outcome = AttWaitOutcome::kError;
        result.event = event;
        result.errorCode = event.payload[8];
        return result;
      }
      manager().handleCentralConnectionEvent(event);
      continue;
    }

    if (attOpcode == responseOpcode) {
      result.outcome = AttWaitOutcome::kResponse;
      result.event = event;
      return result;
    }

    manager().handleCentralConnectionEvent(event);
  }

  return result;
}

bool queueServiceDiscoveryRequest(const BLEUuid& uuid, bool reverse128 = false) {
  if (uuid.size() == 2U) {
    uint8_t request[9] = {kAttOpFindByTypeValueReq, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], 0x0001U);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    writeLe16(&request[7], uuid.uuid16());
    return queueCentralAttProcedure(
        [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); });
  }
  if (uuid.size() == 16U) {
    uint8_t request[23] = {0};
    request[0] = kAttOpFindByTypeValueReq;
    writeLe16(&request[1], 0x0001U);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    for (uint8_t i = 0U; i < 16U; ++i) {
      request[7U + i] = reverse128 ? uuid.uuid128()[15U - i] : uuid.uuid128()[i];
    }
    return queueCentralAttProcedure(
        [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); });
  }
  return false;
}

bool discoverServiceRangeSync(const BLEUuid& uuid, uint16_t* startHandle,
                              uint16_t* endHandle) {
  ScopedCentralSyncProcedure scopedProcedure;
  if (startHandle == nullptr || endHandle == nullptr) {
    return false;
  }
  if (uuid.size() != 16U) {
    if (!queueServiceDiscoveryRequest(uuid, false)) {
      return false;
    }

    const AttWaitResult wait =
        waitForAttOpcode(kAttOpFindByTypeValueReq, kAttOpFindByTypeValueRsp);
    if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 9U) {
      return false;
    }

    *startHandle = readLe16(&wait.event.payload[5]);
    *endHandle = readLe16(&wait.event.payload[7]);
    return (*startHandle != 0U) && (*endHandle >= *startHandle);
  }

  {
    // A 128-bit Find By Type Value request is 23 ATT bytes, which becomes a
    // full 27-byte default LL data PDU before MTU/Data Length negotiation.
    // Walking primary services via Read By Group Type avoids that edge while
    // still discovering the same service range.
  }

  uint16_t searchStart = 0x0001U;
  while (true) {
    uint8_t request[7] = {kAttOpReadByGroupTypeReq, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    if (!queueCentralAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

    const AttWaitResult groupWait =
        waitForAttOpcode(kAttOpReadByGroupTypeReq, kAttOpReadByGroupTypeRsp);
    if (groupWait.outcome == AttWaitOutcome::kError &&
        groupWait.errorCode == kAttErrAttributeNotFound) {
      return false;
    }
    if (groupWait.outcome != AttWaitOutcome::kResponse || groupWait.event.payloadLength < 10U) {
      return false;
    }

    const uint8_t entryLen = groupWait.event.payload[5];
    if (entryLen < 6U) {
      return false;
    }

    uint16_t lastEndHandle = searchStart;
    for (uint8_t offset = 6U;
         (offset + static_cast<uint8_t>(entryLen - 1U)) < groupWait.event.payloadLength;
         offset = static_cast<uint8_t>(offset + entryLen)) {
      const uint16_t candidateStart = readLe16(&groupWait.event.payload[offset]);
      const uint16_t candidateEnd = readLe16(&groupWait.event.payload[offset + 2U]);
      const uint8_t uuidLen = static_cast<uint8_t>(entryLen - 4U);
      const uint8_t* candidateUuid = &groupWait.event.payload[offset + 4U];
      lastEndHandle = candidateEnd;
      if (uuidMatches(uuid, candidateUuid, uuidLen)) {
        *startHandle = candidateStart;
        *endHandle = candidateEnd;
        return (*startHandle != 0U) && (*endHandle >= *startHandle);
      }
    }

    if (lastEndHandle == 0xFFFFU || lastEndHandle < searchStart) {
      break;
    }
    searchStart = static_cast<uint16_t>(lastEndHandle + 1U);
  }

