lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  return false;
}

bool discoverCharacteristicSync(uint16_t serviceStartHandle, uint16_t serviceEndHandle,
                                const BLEUuid& uuid, uint16_t* declHandle,
                                uint16_t* valueHandle, uint16_t* endHandle,
                                uint8_t* properties) {
  ScopedCentralSyncProcedure scopedProcedure;
  if (declHandle == nullptr || valueHandle == nullptr || endHandle == nullptr ||
      serviceStartHandle == 0U || serviceEndHandle == 0U) {
    return false;
  }

  bool found = false;
  uint16_t searchStart = serviceStartHandle;
  *declHandle = 0U;
  *valueHandle = 0U;
  *endHandle = 0U;
  if (properties != nullptr) {
    *properties = 0U;
  }

  while (searchStart <= serviceEndHandle) {
    uint8_t request[7] = {kAttOpReadByTypeReq, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], serviceEndHandle);
    writeLe16(&request[5], kUuidCharacteristic);
    if (!queueCentralAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

    const AttWaitResult wait =
        waitForAttOpcode(kAttOpReadByTypeReq, kAttOpReadByTypeRsp);
    if (wait.outcome == AttWaitOutcome::kError &&
        wait.errorCode == kAttErrAttributeNotFound) {
      break;
    }
    if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 7U) {
      return false;
    }

    const uint8_t entryLen = wait.event.payload[5];
    if (entryLen < 7U) {
      return false;
    }

    uint16_t lastDecl = searchStart;
    bool anyEntry = false;
    for (uint8_t offset = 6U;
         (offset + static_cast<uint8_t>(entryLen - 1U)) < wait.event.payloadLength;
         offset = static_cast<uint8_t>(offset + entryLen)) {
      anyEntry = true;
      const uint16_t candidateDecl = readLe16(&wait.event.payload[offset]);
      const uint8_t candidateProperties = wait.event.payload[offset + 2U];
      const uint16_t candidateValue = readLe16(&wait.event.payload[offset + 3U]);
      const uint8_t uuidLen = static_cast<uint8_t>(entryLen - 5U);
      const uint8_t* candidateUuid = &wait.event.payload[offset + 5U];

      if (found && candidateDecl > *declHandle) {
        *endHandle = static_cast<uint16_t>(candidateDecl - 1U);
        return true;
      }

      if (!found && uuidMatches(uuid, candidateUuid, uuidLen)) {
        found = true;
        *declHandle = candidateDecl;
        *valueHandle = candidateValue;
        *endHandle = serviceEndHandle;
        if (properties != nullptr) {
          *properties = candidateProperties;
        }
      }

      lastDecl = candidateDecl;
    }

    if (found) {
      return true;
    }

    if (!anyEntry || lastDecl >= serviceEndHandle) {
      break;
    }
    searchStart = static_cast<uint16_t>(lastDecl + 1U);
  }

  return found;
}

bool discoverCccdHandleSync(uint16_t valueHandle, uint16_t endHandle, uint16_t* cccdHandle) {
  ScopedCentralSyncProcedure scopedProcedure;
  if (cccdHandle == nullptr || valueHandle == 0U || endHandle <= valueHandle) {
    return false;
  }

  uint16_t searchStart = static_cast<uint16_t>(valueHandle + 1U);
  while (searchStart <= endHandle) {
    uint8_t request[5] = {kAttOpFindInfoReq, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], endHandle);
    if (!queueCentralAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

    const AttWaitResult wait = waitForAttOpcode(kAttOpFindInfoReq, kAttOpFindInfoRsp);
    if (wait.outcome == AttWaitOutcome::kError &&
        wait.errorCode == kAttErrAttributeNotFound) {
      return false;
    }
    if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 6U) {
      return false;
    }

    const uint8_t format = wait.event.payload[5];
    uint16_t lastHandle = searchStart;
    if (format == 0x01U) {
      for (uint8_t offset = 6U; (offset + 3U) < wait.event.payloadLength;
           offset = static_cast<uint8_t>(offset + 4U)) {
        const uint16_t handle = readLe16(&wait.event.payload[offset]);
        const uint16_t uuid16 = readLe16(&wait.event.payload[offset + 2U]);
        if (uuid16 == kUuidClientCharacteristicConfig) {
          *cccdHandle = handle;
          return true;
        }
        lastHandle = handle;
      }
    } else if (format == 0x02U) {
      for (uint8_t offset = 6U; (offset + 17U) < wait.event.payloadLength;
           offset = static_cast<uint8_t>(offset + 18U)) {
        lastHandle = readLe16(&wait.event.payload[offset]);
      }
    } else {
      return false;
    }

    if (lastHandle >= endHandle) {
      return false;
    }
    searchStart = static_cast<uint16_t>(lastHandle + 1U);
  }

  return false;
}

uint16_t readHandleSync(uint16_t handle, uint8_t* buffer, uint16_t bufferLen) {
  ScopedCentralSyncProcedure scopedProcedure;
  if (handle == 0U || buffer == nullptr || bufferLen == 0U ||
      !queueCentralAttProcedure(
          [&]() { return manager().radio().queueAttReadRequest(handle); })) {
    return 0U;
  }

  const AttWaitResult wait = waitForAttOpcode(kAttOpReadReq, kAttOpReadRsp);
  if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 5U) {
    return 0U;
  }

  const uint16_t valueLen = static_cast<uint16_t>(wait.event.payloadLength - 5U);
  const uint16_t copyLen = min<uint16_t>(bufferLen, valueLen);
  if (copyLen > 0U) {
    memcpy(buffer, &wait.event.payload[5], copyLen);
  }
  return copyLen;
}

bool writeHandleSync(uint16_t handle, const uint8_t* data, uint8_t dataLen,
                     bool withResponse = true) {
  ScopedCentralSyncProcedure scopedProcedure;
  if (!queueCentralAttProcedure([&]() {
        return manager().radio().queueAttWriteRequest(handle, data, dataLen, withResponse);
      })) {
    return false;
  }
  if (!withResponse) {
    return true;
  }

  const AttWaitResult wait = waitForAttOpcode(kAttOpWriteReq, kAttOpWriteRsp);
  return wait.outcome == AttWaitOutcome::kResponse;
}

bool executePreparedWriteSync(bool execute) {
  if (!queueCentralAttProcedure([&]() {
        return manager().radio().queueAttExecuteWriteRequest(execute);
      })) {
    return false;
  }

  const AttWaitResult wait =
      waitForAttOpcode(kAttOpExecuteWriteReq, kAttOpExecuteWriteRsp);
  return wait.outcome == AttWaitOutcome::kResponse;
}

bool writeLongHandleSync(uint16_t handle, const uint8_t* data, uint16_t dataLen) {
  ScopedCentralSyncProcedure scopedProcedure;
  g_bluefruitLongWriteDiagCode = 0U;
  g_bluefruitLongWriteDiagSent = 0U;
  g_bluefruitLongWriteDiagChunk = 0U;
  g_bluefruitLongWriteDiagMtu = manager().radio().currentAttMtu();
  g_bluefruitLongWriteDiagDataLength = manager().radio().currentDataLength();
  g_bluefruitLongWriteDiagWaitOutcome = 0U;
  g_bluefruitLongWriteDiagAttError = 0U;
  g_bluefruitLongWriteDiagEventLength = 0U;
  g_bluefruitLongWriteDiagEventOpcode = 0U;
  if (handle == 0U || data == nullptr || dataLen == 0U ||
      dataLen > BleRadio::kCustomGattMaxValueLength) {
    g_bluefruitLongWriteDiagCode = 1U;
    return false;
  }

