lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
BLECharacteristic::BLECharacteristic(BLEUuid bleuuid) : BLECharacteristic() { uuid = bleuuid; }

BLECharacteristic::BLECharacteristic(BLEUuid bleuuid, uint8_t properties)
    : BLECharacteristic(bleuuid) {
  _properties = properties;
}

BLECharacteristic::BLECharacteristic(BLEUuid bleuuid, uint8_t properties, int max_len,
                                     bool fixed_len)
    : BLECharacteristic(bleuuid, properties) {
  setMaxLen(static_cast<uint16_t>(max_len));
  if (fixed_len) {
    setFixedLen(static_cast<uint16_t>(max_len));
  }
}

BLEService& BLECharacteristic::parentService() { return *_service; }

void BLECharacteristic::setTempMemory() { _is_temp = true; }

void BLECharacteristic::setUuid(BLEUuid bleuuid) { uuid = bleuuid; }

void BLECharacteristic::setProperties(uint8_t prop) { _properties = prop; }

void BLECharacteristic::setPermission(SecureMode_t read_perm, SecureMode_t write_perm) {
  _read_perm = read_perm;
  _write_perm = write_perm;
}

void BLECharacteristic::setMaxLen(uint16_t max_len) {
  _max_len = (max_len > BleRadio::kCustomGattMaxValueLength)
                 ? BleRadio::kCustomGattMaxValueLength
                 : max_len;
}

void BLECharacteristic::setFixedLen(uint16_t fixed_len) {
  setMaxLen(fixed_len);
  _fixed_len = true;
}

void BLECharacteristic::setBuffer(void* buf, uint16_t bufsize) {
  _userbuf = static_cast<uint8_t*>(buf);
  _userbufsize = bufsize;
}

uint16_t BLECharacteristic::getMaxLen() const { return _max_len; }

bool BLECharacteristic::isFixedLen() const { return _fixed_len; }

void BLECharacteristic::setUserDescriptor(const char* descriptor) { _usr_descriptor = descriptor; }

void BLECharacteristic::setReportRefDescriptor(uint8_t id, uint8_t type) {
  _report_ref[0] = id;
  _report_ref[1] = type;
  _report_ref_valid = true;
}

void BLECharacteristic::setReportRefDescriptorPermission(SecureMode_t read_perm) {
  _report_ref_read_perm = read_perm;
  _report_ref_read_perm_valid = true;
}

void BLECharacteristic::setPresentationFormatDescriptor(uint8_t type, int8_t exponent,
                                                        uint16_t unit, uint8_t name_space,
                                                        uint16_t descriptor) {
  _presentation_format[0] = type;
  _presentation_format[1] = static_cast<uint8_t>(exponent);
  writeLe16(&_presentation_format[2], unit);
  _presentation_format[4] = name_space;
  writeLe16(&_presentation_format[5], descriptor);
  _presentation_format_valid = true;
}

void BLECharacteristic::setWriteCallback(write_cb_t fp, bool useAdaCallback) {
  (void)useAdaCallback;
  _wr_cb = fp;
}

void BLECharacteristic::setCccdWriteCallback(write_cccd_cb_t fp, bool useAdaCallback) {
  (void)useAdaCallback;
  _cccd_wr_cb = fp;
}

void BLECharacteristic::setReadAuthorizeCallback(read_authorize_cb_t fp, bool useAdaCallback) {
  (void)useAdaCallback;
  _rd_authorize_cb = fp;
}

void BLECharacteristic::setWriteAuthorizeCallback(write_authorize_cb_t fp,
                                                  bool useAdaCallback) {
  (void)useAdaCallback;
  _wr_authorize_cb = fp;
}

err_t BLECharacteristic::begin() {
  if (!manager().begin(1U, 0U)) {
    return ERROR_INVALID_STATE;
  }
  if (_handles.value_handle != 0U) {
    return ERROR_NONE;
  }

  _service = BLEService::lastService;
  if (_service == nullptr || !_service->_begun) {
    return ERROR_INVALID_STATE;
  }

  uint16_t valueHandle = 0U;
  uint16_t cccdHandle = 0U;
  BleRadio::BleCustomGattDescriptorConfig descriptors{};
  BleRadio::BleCustomGattDescriptorHandles descriptorHandles{};
  descriptors.userDescription = _usr_descriptor;
  descriptors.readPermission = static_cast<uint8_t>(_read_perm);
  descriptors.writePermission = static_cast<uint8_t>(_write_perm);
  if (_presentation_format_valid) {
    descriptors.presentationFormat = _presentation_format;
    descriptors.presentationFormatLength =
        BleRadio::kCustomGattPresentationFormatLength;
  }
  if (_report_ref_valid) {
    descriptors.reportReference = _report_ref;
    descriptors.reportReferenceLength = BleRadio::kCustomGattReportReferenceLength;
    if (_report_ref_read_perm_valid) {
      descriptors.reportReferenceReadPermission =
          static_cast<uint8_t>(_report_ref_read_perm);
    }
  }
  const uint16_t initialLen = clampValueLen(_value_len);
  const uint8_t properties = mapProperties(_properties);
  bool ok = false;
  if (uuid.size() == 2U) {
    ok = manager().radio().addCustomGattCharacteristicWithDescriptors(
        _service->_handle, uuid.uuid16(), properties, _value, initialLen, &valueHandle,
        &cccdHandle, &descriptors, &descriptorHandles);
  } else if (uuid.size() == 16U) {
    ok = manager().radio().addCustomGattCharacteristic128WithDescriptors(
        _service->_handle, uuid.uuid128(), properties, _value, initialLen, &valueHandle,
        &cccdHandle, &descriptors, &descriptorHandles);
  }
  if (!ok) {
    return ERROR_INVALID_STATE;
  }

  _handles.value_handle = valueHandle;
  _handles.decl_handle = (valueHandle > 0U) ? static_cast<uint16_t>(valueHandle - 1U) : 0U;
  _handles.cccd_handle = cccdHandle;
  _handles.user_desc_handle = descriptorHandles.userDescriptionHandle;
  if (!manager().registerCharacteristic(this)) {
    return ERROR_NO_MEM;
  }
  return ERROR_NONE;
}

ble_gatts_char_handles_t BLECharacteristic::handles() const { return _handles; }

uint16_t BLECharacteristic::write(const void* data, uint16_t len) {
  if (data == nullptr && len > 0U) {
    return 0U;
  }
  const uint16_t toWrite = clampValueLen((_fixed_len && _max_len > 0U) ? _max_len : len);
  memset(_value, 0, sizeof(_value));
  if (data != nullptr && toWrite > 0U) {
    memcpy(_value, data, min<uint16_t>(toWrite, clampValueLen(len)));
  }
  _value_len = toWrite;
  if (_userbuf != nullptr && _userbufsize > 0U) {
    const uint16_t copied = min<uint16_t>(_userbufsize, _value_len);
    memcpy(_userbuf, _value, copied);
  }
  if (_handles.value_handle != 0U) {
    manager().radio().setCustomGattCharacteristicValue(_handles.value_handle, _value, _value_len);
  }
  return _value_len;
}

uint16_t BLECharacteristic::write(const char* str) {
  return write(str, (str != nullptr) ? static_cast<uint16_t>(strlen(str)) : 0U);
}

uint16_t BLECharacteristic::write8(uint8_t num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::write16(uint16_t num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::write32(uint32_t num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::write32(int num) { return write(&num, sizeof(num)); }

