lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLEPeriph::setConnIntervalMS(uint16_t min_ms, uint16_t max_ms) {
  return setConnInterval(MS100TO125(min_ms), MS100TO125(max_ms));
}

bool BLEPeriph::setConnSlaveLatency(uint16_t latency) {
  conn_latency_ = latency;
  manager().radio().setPreferredConnectionParameters(conn_interval_min_, conn_interval_max_,
                                                     conn_latency_,
                                                     conn_supervision_timeout_);
  return true;
}

bool BLEPeriph::setConnSupervisionTimeout(uint16_t timeout) {
  conn_supervision_timeout_ = timeout;
  manager().radio().setPreferredConnectionParameters(conn_interval_min_, conn_interval_max_,
                                                     conn_latency_,
                                                     conn_supervision_timeout_);
  return true;
}

bool BLEPeriph::setConnSupervisionTimeoutMS(uint16_t timeout_ms) {
  return setConnSupervisionTimeout(timeout_ms / 10U);
}

void BLEPeriph::clearBonds() {
  (void)manager().radio().clearBondRecord();
}

BLEConnection::BLEConnection() : handle_(INVALID_CONNECTION_HANDLE) {}

uint16_t BLEConnection::handle() const { return handle_; }

bool BLEConnection::connected() const { return Bluefruit.connected(handle_); }

bool BLEConnection::bonded() const { return connected() && manager().radio().hasBondRecord(); }

bool BLEConnection::secured() const {
  return connected() && manager().radio().isConnectionEncrypted();
}

bool BLEConnection::authenticated() const {
  return connected() && manager().radio().isConnectionAuthenticated();
}

bool BLEConnection::getPeerName(char* name, uint16_t bufsize) const {
  if (name == nullptr || bufsize == 0U || !manager().radio().isConnected()) {
    return false;
  }
  BleConnectionInfo info{};
  if (!manager().radio().getConnectionInfo(&info)) {
    return false;
  }
  snprintf(name, bufsize, "%02X:%02X:%02X:%02X:%02X:%02X", info.peerAddress[5],
           info.peerAddress[4], info.peerAddress[3], info.peerAddress[2], info.peerAddress[1],
           info.peerAddress[0]);
  return true;
}

bool BLEConnection::disconnect() const { return Bluefruit.disconnect(handle_); }

bool BLEConnection::requestPHY(uint8_t phy) {
  if (!connected()) {
    return false;
  }
  const uint8_t normalized = normalizeBluefruitPhy(phy);
  if (normalized == BLE_GAP_PHY_AUTO) {
    return false;
  }
  if (ScopedBluefruitUserCallback::active()) {
    return manager().deferConnectionPhyRequest(normalized);
  }
  return manager().radio().requestPHY(normalized);
}

uint8_t BLEConnection::getPHY() const {
  return connected() ? manager().radio().getPHY() : BLE_GAP_PHY_AUTO;
}

uint16_t BLEConnection::getConnectionInterval() const {
  if (!connected()) {
    return 0U;
  }
  BleConnectionInfo info{};
  return manager().radio().getConnectionInfo(&info) ? info.intervalUnits : 0U;
}

uint16_t BLEConnection::getSlaveLatency() const {
  if (!connected()) {
    return 0U;
  }
  BleConnectionInfo info{};
  return manager().radio().getConnectionInfo(&info) ? info.latency : 0U;
}

uint16_t BLEConnection::getSupervisionTimeout() const {
  if (!connected()) {
    return 0U;
  }
  BleConnectionInfo info{};
  return manager().radio().getConnectionInfo(&info) ? info.supervisionTimeoutUnits : 0U;
}

uint16_t BLEConnection::getDataLength() const {
  return connected() ? manager().radio().currentDataLength() : 0U;
}

bool BLEConnection::requestDataLengthUpdate() {
  if (!connected()) {
    return false;
  }
  manager().noteExplicitDataLengthRequest();
  if (ScopedBluefruitUserCallback::active()) {
    return manager().deferConnectionDataLengthUpdate();
  }
  return manager().radio().requestDataLengthUpdate();
}

bool BLEConnection::requestMtuExchange(uint16_t mtu) {
  if (!connected()) {
    return false;
  }
  manager().noteExplicitCentralMtuRequest(mtu);
  if (ScopedBluefruitUserCallback::active()) {
    return manager().deferConnectionMtuExchange(mtu);
  }
  return manager().radio().requestAttMtuExchange(mtu);
}

uint16_t BLEConnection::getMtu() const {
  if (!connected()) {
    return 23U;
  }
  return manager().radio().currentAttMtu();
}

bool BLEConnection::requestPairing() const {
  if (!connected()) {
    return false;
  }
  return manager().radio().requestPairing();
}

bool BLEConnection::monitorRssi(uint8_t threshold) const {
  if (!connected()) {
    return false;
  }
  return manager().startRssiMonitor(threshold);
}

int8_t BLEConnection::getRssi() const {
  if (!connected()) {
    return 0;
  }
  return manager().currentConnectionRssi();
}

BLECentral::BLECentral() : connect_callback_(nullptr), disconnect_callback_(nullptr) {}

void BLECentral::setConnectCallback(ble_connect_callback_t fp) { connect_callback_ = fp; }

void BLECentral::setDisconnectCallback(ble_disconnect_callback_t fp) {
  disconnect_callback_ = fp;
}

bool BLECentral::connect(const ble_gap_evt_adv_report_t* report) {
  if (!manager().begin(0U, 1U)) {
    return false;
  }
  return manager().queueCentralConnect(report);
}

bool BLECentral::connected() const {
  serviceBluefruitBeforePollingState();
  return manager().radio().isConnected() &&
         manager().radio().connectionRole() == BleConnectionRole::kCentral;
}

void BLECentral::setMissingPeerDisconnectEvents(uint16_t events) {
  manager().radio().setCentralMissingPeerDisconnectEvents(events);
}

void BLECentral::clearBonds() {
  (void)manager().radio().clearBondRecord();
}

BLEScanner::BLEScanner()
    : rx_callback_(nullptr),
      interval_(160U),
      window_(80U),
      low_power_interval_(0U),
      low_power_window_(0U),
      low_power_after_ms_(0U),
      started_ms_(0UL),
      timeout_s_(0U),
      active_scan_(false),
      restart_on_disconnect_(false),
      running_(false),
      paused_(false),
      has_filter_uuid_(false),
      filter_uuid_(),
      has_filter_msd_(false),
      filter_msd_company_(0U),
      has_filter_rssi_(false),
      filter_rssi_dbm_(-127) {}

void BLEScanner::setRxCallback(rx_callback_t fp) { rx_callback_ = fp; }

void BLEScanner::setInterval(uint16_t interval, uint16_t window) {
  interval_ = interval;
  window_ = (window == 0U) ? interval : window;
}

void BLEScanner::setIntervalMS(uint16_t interval_ms, uint16_t window_ms) {
  setInterval(MS1000TO625(interval_ms),
              (window_ms == 0U) ? 0U : MS1000TO625(window_ms));
}

void BLEScanner::setLowPowerBackoffMS(uint32_t after_ms, uint16_t interval_ms,
                                      uint16_t window_ms) {
  low_power_after_ms_ = after_ms;
  low_power_interval_ = (interval_ms == 0U) ? 0U : MS1000TO625(interval_ms);
  low_power_window_ = (window_ms == 0U) ? 0U : MS1000TO625(window_ms);
}

void BLEScanner::useActiveScan(bool enabled) { active_scan_ = enabled; }

void BLEScanner::restartOnDisconnect(bool enabled) { restart_on_disconnect_ = enabled; }

void BLEScanner::filterUuid(const BLEUuid& uuid) {
  filter_uuid_ = uuid;
  has_filter_uuid_ = uuid.begin();
}

