lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
uint16_t BLEClientCharacteristic::writeWithoutResponse(const void* buffer,
                                                       uint16_t len) {
  return write(buffer, len, false);
}

uint16_t BLEClientCharacteristic::write8(uint8_t value) {
  return write(&value, sizeof(value));
}

uint16_t BLEClientCharacteristic::write8(uint8_t value, bool withResponse) {
  return write(&value, sizeof(value), withResponse);
}

uint16_t BLEClientCharacteristic::write8WithoutResponse(uint8_t value) {
  return writeWithoutResponse(&value, sizeof(value));
}

bool BLEClientCharacteristic::enableNotify() {
  if (!discovered_) {
    return false;
  }
  if (cccd_handle_ == 0U &&
      !retryCentralProcedure([&]() {
        return discoverCccdHandleSync(value_handle_, end_handle_, &cccd_handle_);
      })) {
    return false;
  }
  const uint8_t cccdValue[2] = {0x01U, 0x00U};
  return retryCentralProcedure([&]() {
    return writeHandleSync(cccd_handle_, cccdValue, sizeof(cccdValue), true);
  });
}

bool BLEClientCharacteristic::disableNotify() {
  if (!discovered_) {
    return false;
  }
  if (cccd_handle_ == 0U &&
      !retryCentralProcedure([&]() {
        return discoverCccdHandleSync(value_handle_, end_handle_, &cccd_handle_);
      })) {
    return false;
  }
  const uint8_t cccdValue[2] = {0x00U, 0x00U};
  return retryCentralProcedure([&]() {
    return writeHandleSync(cccd_handle_, cccdValue, sizeof(cccdValue), true);
  });
}

void BLEClientCharacteristic::handleNotify(const uint8_t* data, uint16_t len) {
  const uint8_t copyLen = min<uint16_t>(len, sizeof(last_value_));
  if (copyLen > 0U && data != nullptr) {
    memcpy(last_value_, data, copyLen);
  }
  last_value_len_ = copyLen;
  if (notify_callback_ != nullptr) {
    pending_notify_callback_ = true;
  }
}

void BLEClientCharacteristic::dispatchPendingNotify() {
  if (!pending_notify_callback_ || notify_callback_ == nullptr) {
    return;
  }
  pending_notify_callback_ = false;
  invokeBluefruitUserCallback(notify_callback_, this, last_value_, last_value_len_);
}

BLEClientService::BLEClientService()
    : uuid(),
      begun_(false),
      discovered_(false),
      conn_handle_(INVALID_CONNECTION_HANDLE),
      start_handle_(0U),
      end_handle_(0U) {}

BLEClientService::BLEClientService(BLEUuid bleuuid)
    : BLEClientService() {
  uuid = bleuuid;
}

bool BLEClientService::begin() {
  if (!manager().begin(0U, 1U)) {
    return false;
  }
  begun_ = true;
  lastService = this;
  return true;
}

void BLEClientService::resetDiscovery() {
  discovered_ = false;
  conn_handle_ = INVALID_CONNECTION_HANDLE;
  start_handle_ = 0U;
  end_handle_ = 0U;
}

bool BLEClientService::discover(uint16_t conn_hdl) {
  resetDiscovery();
  if ((!begun_ && !begin()) || !centralReady(conn_hdl)) {
    return false;
  }
  // Drain any queued link-setup TX (DLE, MTU, PHY) before attempting
  // ATT service discovery, otherwise the ATT request backs up behind it.
  manager().radio().forceClearPendingTx();
  if (!retryCentralProcedure([&]() {
        return discoverServiceRangeSync(uuid, &start_handle_, &end_handle_);
      })) {
    return false;
  }
  conn_handle_ = conn_hdl;
  discovered_ = true;
  lastService = this;
  return true;
}

BLEClientUart* BLEClientUart::instances_[BLEClientUart::kMaxInstances] = {};
uint8_t BLEClientUart::instance_count_ = 0U;

BLEClientUart::BLEClientUart()
    : service_(BLEUART_UUID_SERVICE),
      txd_(BLEUART_UUID_CHR_TXD),
      rxd_(BLEUART_UUID_CHR_RXD),
      discovered_(false),
      rx_callback_(nullptr),
      rx_fifo_{0},
      rx_head_(0U),
      rx_tail_(0U),
      rx_count_(0U) {
  if (instance_count_ < kMaxInstances) {
    instances_[instance_count_++] = this;
  }
}

bool BLEClientUart::begin() {
  txd_.setNotifyCallback(txdNotifyThunk);
  return service_.begin() && txd_.begin(&service_) && rxd_.begin(&service_);
}

bool BLEClientUart::discover(uint16_t conn_hdl) {
  discovered_ = false;
  rx_head_ = 0U;
  rx_tail_ = 0U;
  rx_count_ = 0U;
  if (!begin() || !service_.discover(conn_hdl) || !txd_.discover() || !rxd_.discover()) {
    return false;
  }
  discovered_ = true;
  return true;
}

bool BLEClientUart::enableTXD() { return discovered_ && txd_.enableNotify(); }

int BLEClientUart::read() {
  if (rx_count_ == 0U) {
    return -1;
  }
  const int value = rx_fifo_[rx_tail_];
  rx_tail_ = static_cast<uint16_t>((rx_tail_ + 1U) % kRxFifoDepth);
  --rx_count_;
  return value;
}

int BLEClientUart::read(uint8_t* buffer, size_t size) {
  if (buffer == nullptr || size == 0U) {
    return 0;
  }

  size_t copied = 0U;
  while (copied < size) {
    const int value = read();
    if (value < 0) {
      break;
    }
    buffer[copied++] = static_cast<uint8_t>(value);
  }
  return static_cast<int>(copied);
}

int BLEClientUart::available() { return rx_count_; }

int BLEClientUart::peek() {
  if (rx_count_ == 0U) {
    return -1;
  }
  return rx_fifo_[rx_tail_];
}

void BLEClientUart::flush() {}

size_t BLEClientUart::write(uint8_t value) { return write(&value, 1U); }

size_t BLEClientUart::write(const uint8_t* buffer, size_t size) {
  if (!discovered_ || buffer == nullptr || size == 0U || !centralReady(0U) ||
      rxd_.value_handle_ == 0U) {
    return 0U;
  }

  size_t sent = 0U;
  while (sent < size) {
    const uint8_t chunk = min<uint16_t>(BleRadio::kCustomGattMaxValueLength,
                                        static_cast<uint16_t>(size - sent));
    if (!writeHandleSync(rxd_.value_handle_, &buffer[sent], chunk, true)) {
      break;
    }
    sent += chunk;
  }
  return sent;
}

const BLEUuid& BLEClientUart::serviceUuid() const { return service_.uuid; }

void BLEClientUart::handleTxdNotify(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  (void)chr;
  for (uint16_t i = 0U; i < len; ++i) {
    if (rx_count_ >= kRxFifoDepth) {
      break;
    }
    rx_fifo_[rx_head_] = data[i];
    rx_head_ = static_cast<uint16_t>((rx_head_ + 1U) % kRxFifoDepth);
    ++rx_count_;
  }
  if (rx_callback_ != nullptr) {
    invokeBluefruitUserCallback(rx_callback_, *this);
  }
}

void BLEClientUart::txdNotifyThunk(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  for (uint8_t i = 0U; i < instance_count_; ++i) {
    BLEClientUart* instance = instances_[i];
    if (instance != nullptr && (&instance->txd_ == chr)) {
      instance->handleTxdNotify(chr, data, len);
      return;
    }
  }
}

BLEClientDis::BLEClientDis()
    : BLEClientService(UUID16_SVC_DEVICE_INFORMATION),
      manufacturer_(UUID16_CHR_MANUFACTURER_NAME_STRING),
      model_(UUID16_CHR_MODEL_NUMBER_STRING) {}

bool BLEClientDis::begin() {
  return BLEClientService::begin() && manufacturer_.begin() && model_.begin();
}

bool BLEClientDis::discover(uint16_t conn_hdl) {
  if (!begin() || !BLEClientService::discover(conn_hdl)) {
    return false;
  }
  (void)manufacturer_.discover();
  (void)model_.discover();
  return true;
}

bool BLEClientDis::getManufacturer(char* buffer, uint16_t len) {
  if (buffer == nullptr || len == 0U) {
    return false;
  }
  buffer[0] = '\0';
  const uint16_t readLen =
      manufacturer_.discovered() ? manufacturer_.read(buffer, static_cast<uint16_t>(len - 1U))
                                 : 0U;
  buffer[readLen] = '\0';
  return readLen > 0U;
}

bool BLEClientDis::getModel(char* buffer, uint16_t len) {
  if (buffer == nullptr || len == 0U) {
    return false;
  }
  buffer[0] = '\0';
  const uint16_t readLen =
      model_.discovered() ? model_.read(buffer, static_cast<uint16_t>(len - 1U)) : 0U;
  buffer[readLen] = '\0';
  return readLen > 0U;
}

BLEClientBas::BLEClientBas()
    : BLEClientService(UUID16_SVC_BATTERY), battery_(UUID16_CHR_BATTERY_LEVEL) {}

