lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
constexpr uint8_t kHidReportTypeInput = 1U;
constexpr uint8_t kHidReportTypeOutput = 2U;
constexpr uint8_t kHidKeyboardReportId = 1U;
constexpr uint8_t kHidConsumerReportId = 2U;
constexpr uint8_t kHidMouseReportId = 3U;
constexpr uint8_t kHidGamepadReportId = 1U;
constexpr uint8_t kHidZephyrMouseReportId = 1U;
constexpr uint8_t kHidProtocolModeBoot = 0U;
constexpr uint8_t kHidProtocolModeReport = 1U;

const uint8_t kHidInfoValue[] = {
    0x11U, 0x01U,  // HID v1.11
    0x00U,         // country code: not localized
    0x02U,         // normally connectable
};

const uint8_t kHidZephyrInfoValue[] = {
    0x00U, 0x00U,  // Zephyr peripheral_hids sample uses HID version 0.00.
    0x00U,         // country code: not localized
    0x02U,         // normally connectable
};

const uint8_t kHidZephyrMouseReportMap[] = {
    0x05U, 0x01U,  // Usage Page (Generic Desktop)
    0x09U, 0x02U,  // Usage (Mouse)
    0xA1U, 0x01U,  // Collection (Application)
    0x85U, kHidZephyrMouseReportId,
    0x09U, 0x01U,  // Usage (Pointer)
    0xA1U, 0x00U,  // Collection (Physical)
    0x05U, 0x09U,  // Usage Page (Button)
    0x19U, 0x01U,  // Usage Minimum (1)
    0x29U, 0x03U,  // Usage Maximum (3)
    0x15U, 0x00U,  // Logical Minimum (0)
    0x25U, 0x01U,  // Logical Maximum (1)
    0x95U, 0x03U,  // Report Count (3)
    0x75U, 0x01U,  // Report Size (1)
    0x81U, 0x02U,  // Input (Data,Var,Abs)
    0x95U, 0x01U,  // Report Count (1)
    0x75U, 0x05U,  // Report Size (5)
    0x81U, 0x03U,  // Input (Const,Var,Abs)
    0x05U, 0x01U,  // Usage Page (Generic Desktop)
    0x09U, 0x30U,  // Usage (X)
    0x09U, 0x31U,  // Usage (Y)
    0x15U, 0x81U,  // Logical Minimum (-127)
    0x25U, 0x7FU,  // Logical Maximum (127)
    0x75U, 0x08U,  // Report Size (8)
    0x95U, 0x02U,  // Report Count (2)
    0x81U, 0x06U,  // Input (Data,Var,Rel)
    0xC0U,         // End Collection
    0xC0U,         // End Collection
};

const uint8_t kHidAdafruitReportMap[] = {
    // Keyboard input report, plus the keyboard LED output report.
    0x05U, 0x01U, 0x09U, 0x06U, 0xA1U, 0x01U, 0x85U, kHidKeyboardReportId,
    0x05U, 0x07U, 0x19U, 0xE0U, 0x29U, 0xE7U, 0x15U, 0x00U, 0x25U, 0x01U,
    0x75U, 0x01U, 0x95U, 0x08U, 0x81U, 0x02U, 0x95U, 0x01U, 0x75U, 0x08U,
    0x81U, 0x01U, 0x95U, 0x05U, 0x75U, 0x01U, 0x05U, 0x08U, 0x19U, 0x01U,
    0x29U, 0x05U, 0x91U, 0x02U, 0x95U, 0x01U, 0x75U, 0x03U, 0x91U, 0x01U,
    0x95U, 0x06U, 0x75U, 0x08U, 0x15U, 0x00U, 0x25U, 0x65U, 0x05U, 0x07U,
    0x19U, 0x00U, 0x29U, 0x65U, 0x81U, 0x00U, 0xC0U,

    // Consumer-control media key report: one 16-bit usage value.
    0x05U, 0x0CU, 0x09U, 0x01U, 0xA1U, 0x01U, 0x85U, kHidConsumerReportId,
    0x15U, 0x00U, 0x26U, 0xFFU, 0x03U, 0x19U, 0x00U, 0x2AU, 0xFFU, 0x03U,
    0x75U, 0x10U, 0x95U, 0x01U, 0x81U, 0x00U, 0xC0U,

    // Mouse report: buttons, X/Y/wheel, and horizontal pan.
    0x05U, 0x01U, 0x09U, 0x02U, 0xA1U, 0x01U, 0x09U, 0x01U, 0xA1U, 0x00U,
    0x85U, kHidMouseReportId, 0x05U, 0x09U, 0x19U, 0x01U, 0x29U, 0x05U,
    0x15U, 0x00U, 0x25U, 0x01U, 0x95U, 0x05U, 0x75U, 0x01U, 0x81U, 0x02U,
    0x95U, 0x01U, 0x75U, 0x03U, 0x81U, 0x01U, 0x05U, 0x01U, 0x09U, 0x30U,
    0x09U, 0x31U, 0x09U, 0x38U, 0x15U, 0x81U, 0x25U, 0x7FU, 0x75U, 0x08U,
    0x95U, 0x03U, 0x81U, 0x06U, 0x05U, 0x0CU, 0x0AU, 0x38U, 0x02U, 0x95U,
    0x01U, 0x81U, 0x06U, 0xC0U, 0xC0U,
};

const uint8_t kHidGamepadReportMap[] = {
    0x05U, 0x01U, 0x09U, 0x05U, 0xA1U, 0x01U, 0x85U, kHidGamepadReportId,
    0x09U, 0x30U, 0x09U, 0x31U, 0x09U, 0x32U, 0x09U, 0x35U, 0x09U, 0x33U,
    0x09U, 0x34U, 0x15U, 0x81U, 0x25U, 0x7FU, 0x75U, 0x08U, 0x95U, 0x06U,
    0x81U, 0x02U, 0x09U, 0x39U, 0x15U, 0x00U, 0x25U, 0x08U, 0x35U, 0x00U,
    0x46U, 0x3BU, 0x01U, 0x65U, 0x14U, 0x75U, 0x04U, 0x95U, 0x01U, 0x81U,
    0x42U, 0x75U, 0x04U, 0x95U, 0x01U, 0x81U, 0x01U, 0x05U, 0x09U, 0x19U,
    0x01U, 0x29U, 0x20U, 0x15U, 0x00U, 0x25U, 0x01U, 0x75U, 0x01U, 0x95U,
    0x20U, 0x81U, 0x02U, 0xC0U,
};

err_t beginFixedCharacteristic(BLECharacteristic& characteristic, uint8_t properties,
                               SecureMode_t readPerm, SecureMode_t writePerm,
                               const void* initialValue, uint16_t fixedLength) {
  characteristic.setProperties(properties);
  characteristic.setPermission(readPerm, writePerm);
  characteristic.setFixedLen(fixedLength);
  if (fixedLength > 0U) {
    if (initialValue == nullptr) {
      return ERROR_INVALID_PARAM;
    }
    characteristic.write(initialValue, fixedLength);
  }
  return characteristic.begin();
}

}  // namespace

BLEHidAdafruit::BLEHidAdafruit()
    : BLEService(UUID16_SVC_HUMAN_INTERFACE_DEVICE),
      mouse_buttons_(0U),
      keyboard_led_state_(0U),
      keyboard_led_callback_(nullptr),
      protocol_mode_callback_(nullptr),
      report_protocol_mode_(true),
      zephyr_compatible_mouse_(false),
      protocol_mode_(UUID16_CHR_PROTOCOL_MODE),
      hid_info_(UUID16_CHR_HID_INFORMATION),
      report_map_(UUID16_CHR_REPORT_MAP),
      hid_control_(UUID16_CHR_HID_CONTROL_POINT),
      keyboard_input_(UUID16_CHR_REPORT),
      keyboard_output_(UUID16_CHR_REPORT),
      boot_keyboard_input_(UUID16_CHR_BOOT_KEYBOARD_INPUT_REPORT),
      boot_keyboard_output_(UUID16_CHR_BOOT_KEYBOARD_OUTPUT_REPORT),
      mouse_input_(UUID16_CHR_REPORT),
      boot_mouse_input_(UUID16_CHR_BOOT_MOUSE_INPUT_REPORT),
      consumer_input_(UUID16_CHR_REPORT) {}

void BLEHidAdafruit::setZephyrCompatibleMouse(bool enabled) {
  zephyr_compatible_mouse_ = enabled;
}

err_t BLEHidAdafruit::begin() {
  const err_t status = BLEService::begin();
  if (status != ERROR_NONE) {
    return status;
  }

  report_protocol_mode_ = true;
  keyboard_led_state_ = 0U;

  if (zephyr_compatible_mouse_) {
    err_t result = beginFixedCharacteristic(
        hid_info_, CHR_PROPS_READ, SECMODE_OPEN, SECMODE_NO_ACCESS,
        kHidZephyrInfoValue, sizeof(kHidZephyrInfoValue));
    if (result != ERROR_NONE) {
      return result;
    }

    result = beginFixedCharacteristic(
        report_map_, CHR_PROPS_READ, SECMODE_OPEN, SECMODE_NO_ACCESS,
        kHidZephyrMouseReportMap, sizeof(kHidZephyrMouseReportMap));
    if (result != ERROR_NONE) {
      return result;
    }

    uint8_t emptyMouse[3] = {0U, 0U, 0U};
    mouse_input_.setReportRefDescriptor(kHidZephyrMouseReportId,
                                        kHidReportTypeInput);
    mouse_input_.setReportRefDescriptorPermission(SECMODE_OPEN);
    result = beginFixedCharacteristic(
        mouse_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY, SECMODE_ENC_NO_MITM,
        SECMODE_NO_ACCESS, emptyMouse, sizeof(emptyMouse));
    if (result != ERROR_NONE) {
      return result;
    }

