lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    uint8_t control = 0U;
    result = beginFixedCharacteristic(
        hid_control_, CHR_PROPS_WRITE_WO_RESP, SECMODE_NO_ACCESS,
        SECMODE_ENC_NO_MITM, &control, sizeof(control));
    if (result != ERROR_NONE) {
      return result;
    }

    Bluefruit.Periph.setConnInterval(24, 40);
    return ERROR_NONE;
  }

  const uint8_t protocol = kHidProtocolModeReport;
  protocol_mode_.setWriteCallback(protocolModeWriteThunk);
  err_t result =
      beginFixedCharacteristic(protocol_mode_, CHR_PROPS_READ | CHR_PROPS_WRITE_WO_RESP,
                               SECMODE_ENC_NO_MITM, SECMODE_ENC_NO_MITM,
                               &protocol, sizeof(protocol));
  if (result != ERROR_NONE) {
    return result;
  }

  hid_info_.setProperties(CHR_PROPS_READ);
  result = beginFixedCharacteristic(hid_info_, CHR_PROPS_READ, SECMODE_ENC_NO_MITM,
                                    SECMODE_NO_ACCESS, kHidInfoValue,
                                    sizeof(kHidInfoValue));
  if (result != ERROR_NONE) {
    return result;
  }

  result = beginFixedCharacteristic(report_map_, CHR_PROPS_READ, SECMODE_ENC_NO_MITM,
                                    SECMODE_NO_ACCESS, kHidAdafruitReportMap,
                                    sizeof(kHidAdafruitReportMap));
  if (result != ERROR_NONE) {
    return result;
  }

  hid_keyboard_report_t emptyKeyboard{};
  keyboard_input_.setReportRefDescriptor(kHidKeyboardReportId, kHidReportTypeInput);
  result = beginFixedCharacteristic(keyboard_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyKeyboard, sizeof(emptyKeyboard));
  if (result != ERROR_NONE) {
    return result;
  }

  keyboard_output_.setReportRefDescriptor(kHidKeyboardReportId, kHidReportTypeOutput);
  keyboard_output_.setWriteCallback(keyboard_led_callback_ ? keyboardOutputWriteThunk : nullptr);
  result = beginFixedCharacteristic(
      keyboard_output_, CHR_PROPS_READ | CHR_PROPS_WRITE | CHR_PROPS_WRITE_WO_RESP,
      SECMODE_ENC_NO_MITM, SECMODE_ENC_NO_MITM, &keyboard_led_state_,
      sizeof(keyboard_led_state_));
  if (result != ERROR_NONE) {
    return result;
  }

  boot_keyboard_input_.setWriteCallback(nullptr);
  result = beginFixedCharacteristic(boot_keyboard_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyKeyboard, sizeof(emptyKeyboard));
  if (result != ERROR_NONE) {
    return result;
  }

  boot_keyboard_output_.setWriteCallback(keyboard_led_callback_ ? keyboardOutputWriteThunk
                                                                : nullptr);
  result = beginFixedCharacteristic(
      boot_keyboard_output_, CHR_PROPS_READ | CHR_PROPS_WRITE | CHR_PROPS_WRITE_WO_RESP,
      SECMODE_ENC_NO_MITM, SECMODE_ENC_NO_MITM, &keyboard_led_state_,
      sizeof(keyboard_led_state_));
  if (result != ERROR_NONE) {
    return result;
  }

  hid_mouse_report_t emptyMouse{};
  mouse_input_.setReportRefDescriptor(kHidMouseReportId, kHidReportTypeInput);
  result = beginFixedCharacteristic(mouse_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyMouse, sizeof(emptyMouse));
  if (result != ERROR_NONE) {
    return result;
  }

  result = beginFixedCharacteristic(boot_mouse_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyMouse, sizeof(emptyMouse));
  if (result != ERROR_NONE) {
    return result;
  }

  uint16_t emptyConsumer = 0U;
  consumer_input_.setReportRefDescriptor(kHidConsumerReportId, kHidReportTypeInput);
  result = beginFixedCharacteristic(consumer_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyConsumer, sizeof(emptyConsumer));
  if (result != ERROR_NONE) {
    return result;
  }

  uint8_t control = 0U;
  result = beginFixedCharacteristic(hid_control_, CHR_PROPS_WRITE_WO_RESP,
                                    SECMODE_NO_ACCESS, SECMODE_ENC_NO_MITM,
                                    &control, sizeof(control));
  if (result != ERROR_NONE) {
    return result;
  }

#if defined(ARDUINO_NRF54LM20A) || defined(ARDUINO_NRF54LM20B)
  Bluefruit.Periph.setConnInterval(24, 40);
#else
  Bluefruit.Periph.setConnInterval(9, 12);
#endif
  return ERROR_NONE;
}

void BLEHidAdafruit::setKeyboardLedCallback(kbd_led_cb_t fp) {
  keyboard_led_callback_ = fp;
  keyboard_output_.setWriteCallback(fp ? keyboardOutputWriteThunk : nullptr);
  boot_keyboard_output_.setWriteCallback(fp ? keyboardOutputWriteThunk : nullptr);
}

uint8_t BLEHidAdafruit::keyboardLedState() const {
  return keyboard_led_state_;
}

void BLEHidAdafruit::setProtocolModeCallback(protocol_mode_cb_t fp) {
  protocol_mode_callback_ = fp;
}

uint8_t BLEHidAdafruit::protocolMode() const {
  return report_protocol_mode_ ? BLE_HID_PROTOCOL_MODE_REPORT
                               : BLE_HID_PROTOCOL_MODE_BOOT;
}

bool BLEHidAdafruit::isBootProtocolMode() const {
  return protocolMode() == BLE_HID_PROTOCOL_MODE_BOOT;
}

bool BLEHidAdafruit::isReportProtocolMode() const {
  return protocolMode() == BLE_HID_PROTOCOL_MODE_REPORT;
}

void BLEHidAdafruit::handleKeyboardOutput(uint16_t conn_hdl, uint8_t* data, uint16_t len) {
  if (data != nullptr && len > 0U) {
    keyboard_led_state_ = data[0];
    if (keyboard_led_callback_ != nullptr) {
      invokeBluefruitUserCallback(keyboard_led_callback_, conn_hdl,
                                  keyboard_led_state_);
    }
  }
}

void BLEHidAdafruit::handleProtocolModeWrite(uint16_t conn_hdl, uint8_t* data,
                                             uint16_t len) {
  if (data != nullptr && len > 0U) {
    const uint8_t mode = (data[0] == kHidProtocolModeBoot)
                             ? BLE_HID_PROTOCOL_MODE_BOOT
                             : BLE_HID_PROTOCOL_MODE_REPORT;
    report_protocol_mode_ = (mode == BLE_HID_PROTOCOL_MODE_REPORT);
    if (protocol_mode_callback_ != nullptr) {
      invokeBluefruitUserCallback(protocol_mode_callback_, conn_hdl, mode);
    }
  }
}

void BLEHidAdafruit::keyboardOutputWriteThunk(uint16_t conn_hdl, BLECharacteristic* chr,
                                              uint8_t* data, uint16_t len) {
  if (chr != nullptr) {
    static_cast<BLEHidAdafruit&>(chr->parentService()).handleKeyboardOutput(conn_hdl, data, len);
  }
}

void BLEHidAdafruit::protocolModeWriteThunk(uint16_t conn_hdl, BLECharacteristic* chr,
                                            uint8_t* data, uint16_t len) {
  if (chr != nullptr) {
    static_cast<BLEHidAdafruit&>(chr->parentService())
        .handleProtocolModeWrite(conn_hdl, data, len);
  }
}

bool BLEHidAdafruit::keyboardReport(hid_keyboard_report_t* report) {
  return keyboardReport(BLE_CONN_HANDLE_INVALID, report);
}

bool BLEHidAdafruit::keyboardReport(uint8_t modifier, uint8_t keycode[6]) {
  return keyboardReport(BLE_CONN_HANDLE_INVALID, modifier, keycode);
}

bool BLEHidAdafruit::keyPress(char ch) { return keyPress(BLE_CONN_HANDLE_INVALID, ch); }

