lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLEHidAdafruit::keyRelease(void) { return keyRelease(BLE_CONN_HANDLE_INVALID); }

bool BLEHidAdafruit::keySequence(const char* str, int interval) {
  return keySequence(BLE_CONN_HANDLE_INVALID, str, interval);
}

bool BLEHidAdafruit::keyboardReport(uint16_t conn_hdl, hid_keyboard_report_t* report) {
  if (report == nullptr || !Bluefruit.connected()) {
    return false;
  }
  BLECharacteristic& reportCharacteristic =
      report_protocol_mode_ ? keyboard_input_ : boot_keyboard_input_;
  return reportCharacteristic.notify(conn_hdl, report, sizeof(*report));
}

bool BLEHidAdafruit::keyboardReport(uint16_t conn_hdl, uint8_t modifier, uint8_t keycode[6]) {
  hid_keyboard_report_t report{};
  report.modifier = modifier;
  if (keycode != nullptr) {
    memcpy(report.keycode, keycode, sizeof(report.keycode));
  }
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keyPress(uint16_t conn_hdl, char ch) {
  const uint8_t ascii = static_cast<uint8_t>(ch);
  if (ascii >= 128U) {
    return false;
  }
  hid_keyboard_report_t report{};
  report.modifier = hid_ascii_to_keycode[ascii][0]
                        ? static_cast<uint8_t>(KEYBOARD_MODIFIER_LEFTSHIFT)
                        : 0U;
  report.keycode[0] = hid_ascii_to_keycode[ascii][1];
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keyRelease(uint16_t conn_hdl) {
  hid_keyboard_report_t report{};
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keySequence(uint16_t conn_hdl, const char* str, int interval) {
  if (str == nullptr) {
    return false;
  }
  for (const char* cursor = str; *cursor != '\0'; ++cursor) {
    if (!keyPress(conn_hdl, *cursor)) {
      return false;
    }
    delay(interval);
    if (!keyRelease(conn_hdl)) {
      return false;
    }
    delay(interval);
  }
  return true;
}

bool BLEHidAdafruit::consumerReport(uint16_t usage_code) {
  return consumerReport(BLE_CONN_HANDLE_INVALID, usage_code);
}

bool BLEHidAdafruit::consumerKeyPress(uint16_t usage_code) {
  return consumerKeyPress(BLE_CONN_HANDLE_INVALID, usage_code);
}

bool BLEHidAdafruit::consumerKeyRelease(void) {
  return consumerKeyRelease(BLE_CONN_HANDLE_INVALID);
}

bool BLEHidAdafruit::consumerReport(uint16_t conn_hdl, uint16_t usage_code) {
  if (!Bluefruit.connected()) {
    return false;
  }
  return consumer_input_.notify(conn_hdl, &usage_code, sizeof(usage_code));
}

bool BLEHidAdafruit::consumerKeyPress(uint16_t conn_hdl, uint16_t usage_code) {
  return consumerReport(conn_hdl, usage_code);
}

bool BLEHidAdafruit::consumerKeyRelease(uint16_t conn_hdl) {
  return consumerReport(conn_hdl, 0U);
}

bool BLEHidAdafruit::mouseReport(hid_mouse_report_t* report) {
  return mouseReport(BLE_CONN_HANDLE_INVALID, report);
}

bool BLEHidAdafruit::mouseReport(uint8_t buttons, int8_t x, int8_t y, int8_t wheel, int8_t pan) {
  return mouseReport(BLE_CONN_HANDLE_INVALID, buttons, x, y, wheel, pan);
}

bool BLEHidAdafruit::mouseButtonPress(uint8_t buttons) {
  return mouseButtonPress(BLE_CONN_HANDLE_INVALID, buttons);
}

bool BLEHidAdafruit::mouseButtonRelease(void) {
  return mouseButtonRelease(BLE_CONN_HANDLE_INVALID);
}

bool BLEHidAdafruit::mouseMove(int8_t x, int8_t y) {
  return mouseMove(BLE_CONN_HANDLE_INVALID, x, y);
}

bool BLEHidAdafruit::mouseScroll(int8_t scroll) {
  return mouseScroll(BLE_CONN_HANDLE_INVALID, scroll);
}

bool BLEHidAdafruit::mousePan(int8_t pan) { return mousePan(BLE_CONN_HANDLE_INVALID, pan); }

bool BLEHidAdafruit::mouseReport(uint16_t conn_hdl, hid_mouse_report_t* report) {
  if (report == nullptr || !Bluefruit.connected() ||
      !Bluefruit.Security.isEncrypted(
          (conn_hdl == BLE_CONN_HANDLE_INVALID) ? 0U : conn_hdl)) {
    return false;
  }
  if (zephyr_compatible_mouse_) {
    const uint8_t compactReport[3] = {
        static_cast<uint8_t>(report->buttons & 0x07U),
        static_cast<uint8_t>(report->x),
        static_cast<uint8_t>(report->y),
    };
    return mouse_input_.notify(conn_hdl, compactReport, sizeof(compactReport));
  }
  BLECharacteristic& reportCharacteristic = report_protocol_mode_ ? mouse_input_ : boot_mouse_input_;
  return reportCharacteristic.notify(conn_hdl, report, sizeof(*report));
}

bool BLEHidAdafruit::mouseReport(uint16_t conn_hdl, uint8_t buttons, int8_t x, int8_t y,
                                 int8_t wheel, int8_t pan) {
  mouse_buttons_ = buttons;
  hid_mouse_report_t report{buttons, x, y, wheel, pan};
  return mouseReport(conn_hdl, &report);
}

bool BLEHidAdafruit::mouseNotifyEnabled() {
  return mouseNotifyEnabled(BLE_CONN_HANDLE_INVALID);
}

bool BLEHidAdafruit::mouseNotifyEnabled(uint16_t conn_hdl) {
  BLECharacteristic& reportCharacteristic =
      report_protocol_mode_ ? mouse_input_ : boot_mouse_input_;
  return reportCharacteristic.notifyEnabled(conn_hdl);
}

bool BLEHidAdafruit::mouseButtonPress(uint16_t conn_hdl, uint8_t buttons) {
  mouse_buttons_ |= buttons;
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, 0, 0);
}

bool BLEHidAdafruit::mouseButtonRelease(uint16_t conn_hdl) {
  mouse_buttons_ = 0U;
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, 0, 0);
}

bool BLEHidAdafruit::mouseMove(uint16_t conn_hdl, int8_t x, int8_t y) {
  return mouseReport(conn_hdl, mouse_buttons_, x, y, 0, 0);
}

bool BLEHidAdafruit::mouseScroll(uint16_t conn_hdl, int8_t scroll) {
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, scroll, 0);
}

bool BLEHidAdafruit::mousePan(uint16_t conn_hdl, int8_t pan) {
  return mouseReport(conn_hdl, mouse_buttons_, 0, 0, 0, pan);
}

BLEHidGamepad::BLEHidGamepad()
    : BLEService(UUID16_SVC_HUMAN_INTERFACE_DEVICE),
      protocol_mode_(UUID16_CHR_PROTOCOL_MODE),
      hid_info_(UUID16_CHR_HID_INFORMATION),
      report_map_(UUID16_CHR_REPORT_MAP),
      hid_control_(UUID16_CHR_HID_CONTROL_POINT),
      gamepad_input_(UUID16_CHR_REPORT) {}

err_t BLEHidGamepad::begin() {
  const err_t status = BLEService::begin();
  if (status != ERROR_NONE) {
    return status;
  }

  const uint8_t protocol = kHidProtocolModeReport;
  err_t result =
      beginFixedCharacteristic(protocol_mode_, CHR_PROPS_READ | CHR_PROPS_WRITE_WO_RESP,
                               SECMODE_ENC_NO_MITM, SECMODE_ENC_NO_MITM,
                               &protocol, sizeof(protocol));
  if (result != ERROR_NONE) {
    return result;
  }

  result = beginFixedCharacteristic(hid_info_, CHR_PROPS_READ, SECMODE_ENC_NO_MITM,
                                    SECMODE_NO_ACCESS, kHidInfoValue,
                                    sizeof(kHidInfoValue));
  if (result != ERROR_NONE) {
    return result;
  }

