lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  result = beginFixedCharacteristic(report_map_, CHR_PROPS_READ, SECMODE_ENC_NO_MITM,
                                    SECMODE_NO_ACCESS, kHidGamepadReportMap,
                                    sizeof(kHidGamepadReportMap));
  if (result != ERROR_NONE) {
    return result;
  }

  hid_gamepad_report_t emptyGamepad{};
  gamepad_input_.setReportRefDescriptor(kHidGamepadReportId, kHidReportTypeInput);
  result = beginFixedCharacteristic(gamepad_input_, CHR_PROPS_READ | CHR_PROPS_NOTIFY,
                                    SECMODE_ENC_NO_MITM, SECMODE_NO_ACCESS,
                                    &emptyGamepad, sizeof(emptyGamepad));
  if (result != ERROR_NONE) {
    return result;
  }

  uint8_t control = 0U;
  result = beginFixedCharacteristic(hid_control_, CHR_PROPS_WRITE_WO_RESP,
                                    SECMODE_NO_ACCESS, SECMODE_ENC_NO_MITM,
                                    &control, sizeof(control));
  if (result != ERROR_NONE) {
    return result;
  }

#if defined(ARDUINO_NRF54LM20A) || defined(ARDUINO_NRF54LM20B)
  Bluefruit.Periph.setConnInterval(24, 40);
#else
  Bluefruit.Periph.setConnInterval(9, 12);
#endif
  return ERROR_NONE;
}

bool BLEHidGamepad::report(hid_gamepad_report_t* report) {
  return this->report(BLE_CONN_HANDLE_INVALID, report);
}

bool BLEHidGamepad::report(uint16_t conn_hdl, hid_gamepad_report_t* report) {
  if (report == nullptr || !Bluefruit.connected()) {
    return false;
  }
  return gamepad_input_.notify(conn_hdl, report, sizeof(*report));
}

BLEDis::BLEDis()
    : BLEService(UUID16_SVC_DEVICE_INFORMATION), values_{nullptr}, lengths_{0}, auto_serial_{0} {}

void BLEDis::setSystemID(const char* system_id, uint8_t length) {
  values_[0] = system_id;
  lengths_[0] = length;
}

void BLEDis::setModel(const char* model, uint8_t length) {
  values_[1] = model;
  lengths_[1] = length;
}

void BLEDis::setSerialNum(const char* serial_num, uint8_t length) {
  values_[2] = serial_num;
  lengths_[2] = length;
}

void BLEDis::setFirmwareRev(const char* firmware_rev, uint8_t length) {
  values_[3] = firmware_rev;
  lengths_[3] = length;
}

void BLEDis::setHardwareRev(const char* hw_rev, uint8_t length) {
  values_[4] = hw_rev;
  lengths_[4] = length;
}

void BLEDis::setSoftwareRev(const char* sw_rev, uint8_t length) {
  values_[5] = sw_rev;
  lengths_[5] = length;
}

void BLEDis::setManufacturer(const char* manufacturer, uint8_t length) {
  values_[6] = manufacturer;
  lengths_[6] = length;
}

void BLEDis::setRegCertList(const char* reg_cert_list, uint8_t length) {
  values_[7] = reg_cert_list;
  lengths_[7] = length;
}

void BLEDis::setPNPID(const char* pnp_id, uint8_t length) {
  values_[8] = pnp_id;
  lengths_[8] = length;
}

err_t BLEDis::begin() {
  static const uint16_t kCharacteristicUuids[9] = {
      UUID16_CHR_SYSTEM_ID,        UUID16_CHR_MODEL_NUMBER_STRING,
      UUID16_CHR_SERIAL_NUMBER_STRING, UUID16_CHR_FIRMWARE_REVISION_STRING,
      UUID16_CHR_HARDWARE_REVISION_STRING, UUID16_CHR_SOFTWARE_REVISION_STRING,
      UUID16_CHR_MANUFACTURER_NAME_STRING, UUID16_CHR_REGULATORY_CERT_DATA_LIST,
      UUID16_CHR_PNP_ID};
  static constexpr char kDefaultManufacturer[] = "Seeed Studio";
  static constexpr char kDefaultModel[] = "XIAO nRF54L15";
  static constexpr char kDefaultHardwareRev[] = "XIAO nRF54L15";
#if defined(ARDUINO_NRF54LM20A) || defined(ARDUINO_NRF54LM20B)
  static constexpr char kDefaultPnpId[] = {
      0x02,       // Vendor ID source: USB Implementers Forum
      0x86, 0x28, // Seeed USB VID 0x2886
      0x68, 0x00, // XIAO nRF54LM20 CMSIS-DAP USB PID 0x0068
      0x01, 0x00  // Product version 0.1
  };
#else
  static constexpr char kDefaultPnpId[] = {
      0x02,       // Vendor ID source: USB Implementers Forum
      0x86, 0x28, // Seeed USB VID 0x2886
      0x66, 0x00, // XIAO nRF54L15 CMSIS-DAP USB PID 0x0066
      0x01, 0x00  // Product version 0.1
  };
#endif

  const err_t status = BLEService::begin();
  if (status != ERROR_NONE) {
    return status;
  }

  if (values_[1] == nullptr || lengths_[1] == 0U) {
    setModel(kDefaultModel);
  }
  if (values_[2] == nullptr || lengths_[2] == 0U) {
    snprintf(auto_serial_, sizeof(auto_serial_), "%08" PRIX32 "%08" PRIX32,
             NRF_FICR->INFO.DEVICEID[1], NRF_FICR->INFO.DEVICEID[0]);
    setSerialNum(auto_serial_);
  }
  if (values_[3] == nullptr || lengths_[3] == 0U) {
    setFirmwareRev(NRF54L15_CLEAN_CORE_VERSION_STRING);
  }
  if (values_[4] == nullptr || lengths_[4] == 0U) {
    setHardwareRev(kDefaultHardwareRev);
  }
  if (values_[5] == nullptr || lengths_[5] == 0U) {
    setSoftwareRev(NRF54L15_CLEAN_CORE_VERSION_STRING);
  }
  if (values_[6] == nullptr || lengths_[6] == 0U) {
    setManufacturer(kDefaultManufacturer);
  }
  if (values_[8] == nullptr || lengths_[8] == 0U) {
    setPNPID(kDefaultPnpId, sizeof(kDefaultPnpId));
  }

  for (uint8_t i = 0U; i < 9U; ++i) {
    if (values_[i] == nullptr || lengths_[i] == 0U) {
      continue;
    }
    const uint8_t len =
        static_cast<uint8_t>(min<uint16_t>(clampValueLen(lengths_[i]), 0xFFU));
    if (!manager().radio().addCustomGattCharacteristic(
            _handle, kCharacteristicUuids[i], xiao_nrf54l15::kBleGattPropRead,
            reinterpret_cast<const uint8_t*>(values_[i]), len, nullptr, nullptr)) {
      return ERROR_INVALID_STATE;
    }
  }
  return ERROR_NONE;
}

BLEDfu::BLEDfu() : BLEService(kUuidDfuService) {}

err_t BLEDfu::begin() {
  _begun = true;
  lastService = this;
  return ERROR_NONE;
}

BLEBas::BLEBas() : BLEService(UUID16_SVC_BATTERY) {}

err_t BLEBas::begin() {
  _begun = true;
  lastService = this;
  return ERROR_NONE;
}

bool BLEBas::write(uint8_t level) { return manager().radio().setGattBatteryLevel(level); }

bool BLEBas::notify(uint8_t level) { return notify(0U, level); }

bool BLEBas::notify(uint16_t conn_hdl, uint8_t level) {
  (void)conn_hdl;
  return write(level);
}

BLEUart::BLEUart(uint16_t fifo_depth)
    : BLEService(BLEUART_UUID_SERVICE),
      _txd(BLEUART_UUID_CHR_TXD),
      _rxd(BLEUART_UUID_CHR_RXD),
      _rx_fifo_depth((fifo_depth == 0U) ? 1U : fifo_depth),
      _rx_fifo(new uint8_t[(fifo_depth == 0U) ? 1U : fifo_depth]),
      _rx_head(0U),
      _rx_tail(0U),
      _rx_count(0U),
      _tx_buffered(false),
      _rx_cb(nullptr),
      _notify_cb(nullptr),
      _overflow_cb(nullptr) {}

